{
    "0": [
        "Outputs A & B are simple sums of inputs X & Y and an offset, according to parameter 1:",
        "0: A is Sum of inputs X & Y, plus the offset. B is Difference between inputs X & Y, minus the offset. With nothing plugged into input X, B is therefore simply an inverted copy of Y.",
        "1: A is X plus the offset. B is Y minus the offset. This is particularly useful for shifting between bipolar (e.g. ±5V) and unipolar (e.g. 0-10V) CVs and back again.",
        "2: A is X plus the offset. B is Y plus the offset.",
        "The Z knob/CV sets an offset which is applied to both A and B. The offset is a whole number of Volts. If X/Y are 1V/Octave pitch CVs, Z is therefore an octave shift control. The maximum shift is 10V, positive or negative.",
        "When Z changes, the offset is shown on the display. After a short while the display reverts to showing the current algorithm.",
        "When parameter 0 is 1, the offset is not restricted to 1V steps, and changes smoothly with Z."
    ],
    "1": [
        "Output A is the result of multiplying inputs X & Y. Output B is the inverse of output A.",
        "If for example X is a signal and Y is an envelope, then this algorithm is a VCA. If both inputs are signals, then this is a ring modulator.",
        "The Z knob/CV sets a scale factor which is applied to both outputs. The scale is an integer (whole number) which either multiplies or divides the result, and ranges in value from 1-10.",
        "When Z changes, the scale is shown on the display. If the value shown is negative, it is a divisor rather than a multipler. Note that there is no value of \"-1\" since dividing by 1 and multiplying by 1 are the same. After a short while the display reverts to showing the current algorithm.",
        "When parameter 0 is 1, the scale is not restricted to integer steps, and changes smoothly with Z.",
        "Parameter 1 applies an offset to the Y input, in whole Volts. This is convenient if you just want to multiply the X input by a constant, which you can then dial in with the Y Offset and Z."
    ],
    "2": [
        "This algorithm provides a full-wave rectifier or absolute value function. The Z knob/CV select between one of two modes. In 'independent' mode, A and B are the absolute values of X and Y, respectively. In 'combined' mode, A is the absolute value of the sum of X & Y; B is the absolute value of the difference of X & Y.",
        "When Z changes, the mode is displayed. 'Independent' mode is shown as \"-0\"; 'combined' mode as \"0\". After a short while the display reverts to showing the current algorithm."
    ],
    "3": [
        "Output A is the minimum of inputs X & Y; output B is the maximum of the two inputs. If one input is zero (or disconnected), this is a half-wave rectifier.",
        "The Z knob/CV provides a gate function. When Z goes higher than approximately 2.5V, the gate goes high and the outputs follow the inputs according to the min/max relationship. When Z goes below approximately -1.5V, the gate goes low and the outputs are frozen.",
        "When the gate changes state, \"LO\" or \"HI\" is displayed to indicate the gate status. After a short while the display reverts to showing the current algorithm."
    ],
    "4": [
        "This algorithm provides a linear-to-exponential converter and an exponential-to-linear converter. You might use this to interface 1V/octave modules (Eurorack standard) with Hz/V synths (e.g. old Korg or Yamaha synths), but it could also be useful within Eurorack e.g. to convert an LFO (commonly with Hz/V pitch control) to a V/octave oscillator, or to convert an exponential FM input on a VCO into a linear FM input.",
        "Input X is the exponential input; its corresponding linear output is A. Y is the linear input, whose exponential output is B.",
        "Z sets the scale factor which is common to both conversions. It sets the number of Hz per Volt, with arrange from near zero to about 2kHz. The Yamaha CS-15, for example, uses about 1100Hz/V, which is about half way on the Z knob here.",
        "The zero Volt point on the exponential scale used is C3 (approximately 130.81Hz).",
        "Parameters 0 & 1 switch their respective outputs to function as gate inverters. (Some old synths e.g. the Korg MS-20 have a Hz/V pitch input and an inverted gate, compared to the Eurorack norm.) The output is then 5V/0V for an input gate in excess of 1V."
    ],
    "5": [
        "Output A is a quantized version of input X; the closest whole-semitone value to the unquantized V/octave pitch CV X. Output B is a trigger signal which fires whenever output A changes - a 5V pulse approximately 10ms long.",
        "As well as providing a chromatic scale, this algorithm can also constrain the quantized values to a musical scale or chord. This is controlled by the Z knob/CV.",
        "When Z changes, the scale is displayed on the LEDs. The scale's number in the following table is shown, and after a short pause, the scale's name.",
        "0 chromatic",
        "1 major scale",
        "2 minor scale",
        "3 major triad",
        "4 minor triad",
        "5 root+5th",
        "6 major triad+6th",
        "7 minor triad+6th",
        "8 major triad+7th",
        "9 minor triad+7th",
        "10 root+5th+6th",
        "11 root+5th+7th",
        "12 pentatonic major",
        "13 pentatonic minor",
        "14 natural minor scale",
        "15 harmonic minor scale",
        "A further option is controlled by Z being positive or negative. When Z is negative, the scale number is shown as a negative value.",
        "When Z is positive input Y is a transpose control. The CV on input Y is quantized (to a chromatic scale) and added to the quantized result in one of two ways, controlled by parameter 1. If parameter 1 is zero, the transposition is applied to output A, after input X has been quantized to the chosen scale. If parameter 1 is one, the transposition is applied to input X before it is forced into the chosen scale. So, in mode zero the overall key of the quantization is transposed, whereas in mode one the transposition moves the notes around within the same key.",
        "When Z is negative input Y is a trigger. In this mode, input X is only sampled and converted to a new quantized value when input Y rises over approximately 1V. (In non-triggered mode, X is constantly sampled and a new note is output as soon as X moves into the next semitone range.)",
        "Parameter 2 sets the root key of the chosen scale. At zero, the first note of the scale (e.g. C in the key of C) corresponds to 0V. If the parameter is set for example to 2, the first note of the scale is at 2/12 = 0.1667V - or to look at it another way, if your VCO is tuned so that 0V gives you a C, the quantizer is now working in the key of D (D major, minor, triad etc. depending on the scale setting).",
        "Parameter 3 sets an offset between the timing of the X & Y inputs (in sample frames). When using Y as a trigger, it is often a good idea to delay it slightly relative to the pitch, to ensure that the pitch has changed and settled before the trigger samples a new note.",
        "MIDI Output: each new note (i.e. when the Output B trigger fires) is output as a MIDI note message on the MIDI channel selected in the settings.",
        "Parameter 4 controls when note off messages are sent. If parameter 4 is zero (the default), the note off is sent just before the note on – so the note lasts from one change to the next, which is conceptually the same as the CV output. If parameter 4 is one, and Z is negative (so Y is a trigger), then the trigger is treated as a gate, and the note off message is sent when the gate goes low.",
        "MIDI Input: MIDI note messages received on MIDI channel 1 set parameter 2 (root key)."
    ],
    "6": [
        "Output A is a gate signal (zero or +5V), high when input X has a higher voltage than input Y. Output B is an inverted copy of A (i.e. +5V when A is 0V and vice versa.)",
        "The Z knob/CV input sets the hysteresis (for an explanation of hysteresis see here). Inputs of approximately 0-4V correspond to hysteresis values of approximately 0-10V. Negative values are clamped at zero."
    ],
    "7": [
        "This algorithm provides two independent waveshaping functions. The Z knob/CV is a gain control, with a range of approximately 30x. Negative values of Z invert the signal.",
        "Input X/output A provide what is usually termed a wavefolder. This increases the harmonic content of the sound in interesting ways, especially as the gain changes.",
        "Input Y/output B provide a triangle-to-sine waveshaper. Used on most audio this is a relatively gentle form of overdrive/saturation. However, when fed with the right level of triangle wave, the output is exactly a sine wave, which is useful when you have a triangle wave VCO handy but really want a pure sine wave instead."
    ],
    "8": [
        "If parameter 0 is 0 (the default): Output A is a sample of input X, taken when the trigger input Y goes over 1V. (Sample and Hold)",
        "If parameter 0 is 1: Output A follows input X while input Y is over 1V. When Y falls below 0.5V, output A is held until Y goes over 1V again. (Track and Hold)",
        "Output B is a white noise signal, with range ±8V. A noise signal is commonly fed into the input of a sample and hold device to generate clocked random voltages.",
        "Parameter 2 controls the noise colour:",
        "0 Violet",
        "1 White",
        "2 Pink",
        "3 Red",
        "The Z knob/CV controls the slew rate of output A. At the minimum value of Z, changes in A are instantaneous. As Z increases, changes in A take place more slowly.",
        "Pressing the Z knob triggers a sample manually.",
        "Parameter 1 sets an offset between the timing of the X & Y inputs (in sample frames). If X & Y are being driven together, for example by a sequencer's pitch and gate, it is often a good idea to delay the trigger slightly to allow time for the sampled CV to settle before the sample is taken.",
        "Parameter 3 adds the noise output into the input signal, equivalent to patching output B into input X via an attenuator."
    ],
    "9": [
        "Outputs A & B are both slew rate limited copies of the sum of X & Y. Output A uses linear slew rate limiting; a step change in the input will typically result in a ramp output, until the output reaches its desired value, at which point it will be constant. Output B uses logarithmic slew rate limiting; a step change in input results in a smooth curve that gradually approaches the desired value.",
        "The Z knob/CV controls the slew rate for both outputs. At the minimum value of Z, changes are very rapid. As Z increases, changes take place more slowly.",
        "Parameters 0 & 1 allow for independent control of the slew times when the signal is rising or falling. If each parameter is -1, the corresponding slew rate is controlled by Z. Otherwise, the slew rate is set by the parameter value."
    ],
    "10": [
        "This algorithm provides pitch and envelope tracking of an incoming audio signal. It will track frequencies down to about 27Hz, which is just below the lowest note on a standard 88 key piano.",
        "Output A is a 1V/octave pitch CV reflecting the pitch of the signal on input X. The 0V point is C3 (approximately 130.81Hz). Input Y is simply added to the pitch CV, providing a means of applying e.g. vibrato, or transposition.",
        "Output B tracks the envelope of the signal on input X. It goes to zero when the algorithm fails to track a pitch.",
        "Knob/CV Z sets the slew rate of the envelope, controlling how quickly it tracks changes in level. At the minimum value of Z, changes can be very rapid, which may produce undesirable effects, especially if pitch tracking is not working well. As Z increases, changes take place more slowly."
    ],
    "11": [
        "This algorithm is a delay/echo effect, primarily intended for processing audio signals, where the delay time is set from a clock pulse. It operates at a quarter of the standard sample rate (i.e. at about 19kHz) and offers a maximum delay time of about 1700ms.",
        "Input X is the signal input. Any audio signal can be fed in here.",
        "Input Y is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the delay time. If the time between triggers is greater than the maximum delay time, the time is divided by two until it is small enough. This way, you always end up with a rhythmically useful delay time.",
        "The Z knob/CV controls the feedback, from zero to slightly more than 100%. Outputs A & B carry signals according to parameter 1:",
        "0 A is mix; B is delay only.",
        "1 A & B are mix.",
        "2 A & B are delay only.",
        "'Mix' is a mix of the dry (undelayed) signal and the delay effect. The amount of delay in the mix rises in direct proportion to the amount of feedback.",
        "'Delay only' is the delayed signal only. Use this and the input signal, plus an external mixer, if you need more flexibility in the dry/wet balance than is offered by the mixed mode.",
        "The first parameter applies a multiplier to the delay time, according to the following table:",
        "-15 1/64",
        "-14 1/48",
        "-13 1/32",
        "-12 1/24",
        "-11 1/16",
        "-10 1/12",
        "-9 1/8",
        "-8 1/6",
        "-7 3/16",
        "-6 1/4",
        "-5 5/16",
        "-4 1/3",
        "-3 3/8",
        "-2 1/2",
        "-1 3/4",
        "1 x1.5",
        "2 x2",
        "3 x3",
        "4 x4",
        "5 x5",
        "6 x6",
        "7 x8",
        "0 x1",
        "8 x16"
    ],
    "12": [
        "Outputs A & B are LFOs (low frequency oscillators), with CV control of frequency and waveshape. The output signals are ±8V (16V peak-to-peak) by default, but can be attentuated via the parameters. The scale factor is (1+parameter value)/32, so at the minimum parameter value of -1 there is no output at all.",
        "The outputs can also have a DC offset applied. The offset in Volts is (parameter value)/4 i.e. the range is ±7.75, in steps of 0.25V.",
        "Input X is a Hz/V frequency control, scaled at 1Hz/V. Note that the input is allowed to go negative, resulting in a phase-reversed output.",
        "Knob/CV Z is a tuning control, with a range of approximately ±10Hz. This is simply added to the setting from input X (so with input X disconnected, the knob can be used to manually set an LFO rate).",
        "Input Y controls the waveshape of the output signals. Signals in the range ±5V give the full range of possible waveshapes:",
        "Output A: saw -> sine -> triangle",
        "Output B: 0% duty cycle pulse -> 50% duty cycle pulse (square) -> 100% duty cycle pulse"
    ],
    "13": [
        "Outputs A & B are LFOs (low frequency oscillators), with CV control of waveshape, and with the LFO cycle time set from a clock input. The output signals are ±8V (16V peak-to-peak) by default, but can be attenuated and inverted via parameters 0 & 1.",
        "Input X is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the cycle time.",
        "Input Y controls the waveshape of the output signals. Signals in the range ±5V give the full range of possible waveshapes:",
        "Output A: saw -> sine -> triangle",
        "Output B: 0% duty cycle pulse -> 50% duty cycle pulse (square) -> 100% duty cycle pulse",
        "Parameter 2 is an offset added to the Y CV, allowing manual selection of the waveshape.",
        "The Z knob/CV sets a scale factor which is applied to the cycle time. The scale is an integer (whole number) which either multiplies or divides the frequency, and ranges in value from 1-16.",
        "When Z changes, the scale is shown on the display. If the value shown is negative, it is a divisor rather than a multiplier. Note that there is no value of \"-1\" since dividing by 1 and multiplying by 1 are the same."
    ],
    "14": [
        "This algorithm is a VCO with a 1V/octave pitch CV input (X), and a linear FM input (Y), scaled at 100Hz/V. Note that, if the FM input goes sufficiently negative, it will take the frequency through and below zero, resulting in a phase inversion (\"thru-zero FM\").",
        "The 0V point for the pitch input is C3 (approximately 130.81Hz).",
        "The Z knob/CV provides a tuning control, with a range of approximately ±0.5 octaves. The A and B outputs provide waveforms according to the following table:",
        "0 Triangle.",
        "1 Sine.",
        "2 Square.",
        "3 Saw.",
        "4 Sub-octave square.",
        "Parameters 3 & 4 control the waveform of outputs A & B respectively. The output signals are ±8V (16V peak-to-peak) by default, but can be attenuated via parameters 1 & 2.",
        "MIDI Input: MIDI note messages received on the MIDI channel set in the Settings are converted to a CV which is added to that on input X. The 0V note is 48 (C3)."
    ],
    "15": [
        "This algorithm is a VCO with a 1V/octave pitch CV input (X), and waveshape/PWM input (Y). The 0V point for the pitch input is C3 (approximately 130.81Hz).",
        "The Z knob/CV provides a tuning control, with a range of approximately ±0.5 octaves (but see also parameter 6, below).",
        "Parameter 4 selects the output waveforms according to the following table:",
        "0 A: Triangle/saw B: Square/pulse",
        "1 A: Triangle/saw B: Sub-octave square",
        "2 A: Square/pulse B: Sub-octave square",
        "Input Y controls the waveshape of the output signals. Signals in the range ±5V give the full range of possible waveshapes:",
        "Triangle/saw: saw (falling) -> triangle -> saw (rising)",
        "Square/pulse: 0% duty cycle pulse -> 50% duty cycle pulse (square) -> 100% duty cycle pulse",
        "The output signals are ±8V (16V peak-to-peak) by default, but can be attenuated via parameters 1 and 2.",
        "Parameter 3 offsets the Y input, effectively providing a manual shape control if required. Parameter 5 transposes the VCO pitch, in semitone increments.",
        "Parameter 6 controls the function of Z. At the default value of -51, Z is the tune control as already mentioned. When the parameter is set to a value from -50 to 50, Z no longer affects the tuning, and the parameter value is used as a fine tune control, in cents. Z then becomes a sync input: when Z goes over approximately 1V, the VCO phase is reset to zero, which can produce 'oscillator sync' sounds.",
        "MIDI Input: MIDI note messages received on the MIDI channel set in the Settings are converted to a CV which is added to that on input X. The 0V note is 48 (C3)."
    ],
    "16": [
        "This algorithm is basically the same as A-1 Precision Adder above, except that where the other algorithm has offsets in steps of 1V, this algorithm allows you to set a divisor for the offset. This defaults to 12, so when used to offset a 1V/octave pitch CV the offsets correspond to semitones."
    ],
    "17": [
        "This algorithm is a voltage controlled delay line, with a maximum delay time of just over 200ms. As well as simple echoes, this can produce a wide variety of effects such as vibrato, chorus and flange.",
        "A control signal of 0-8V on the Y input sets the delay time, with a linear voltage/time relationship. Parameter 0 can be used to set this to a 'centre' value, which makes it easier to patch in an LFO to the Y input without having to add a DC offset to the LFO.",
        "Parameter 1 is an attenuverter for Y, applied before the offset.",
        "Z is a feedback control. It is zero at 0V input, and provides negative feedback for negative voltages.",
        "A outputs the delay signal only. Use this for vibrato effects, or if you want a controllable mix of dry and delayed signal.",
        "B outputs the delay and dry signals mixed in equal amounts. In combination with an LFO on the delay time, this is the quickest route to chorus/flange type effects.",
        "Parameter 2 enables a saturation stage on the input to the delay line. This can prevent unpleasant distortion when the feedback becomes high, at the expense of some colouration of the sound."
    ],
    "18": [
        "This algorithm is a stereo ping-pong delay/echo effect, primarily intended for processing audio signals, where the delay time is set from a clock pulse. It operates at a quarter of the standard sample rate (i.e. at about 19kHz) and offers a maximum delay time of about 900ms.",
        "Input X is the signal input. Any audio signal can be fed in here.",
        "Input Y is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the delay time. If the time between triggers is greater than the maximum delay time, the time is divided by two until it is small enough. This way, you always end up with a rhythmically useful delay time.",
        "Parameter 1 applies a multiplier to the delay time, according to the table above. The Z knob/CV controls the feedback, from zero to slightly more than 100%.",
        "Outputs A & B are the left and right outputs respectively. If the output mode parameter is 0 (the default), they are a mix of the dry (undelayed) signal and the delay effect. The amount of delay in the mix rises in direct proportion to the amount of feedback. If the output mode parameter is 1, the outputs are the delayed signals only. Use this and the input signal, plus an external mixer, if you need more flexibility in the dry/wet balance than is offered by output mode 0.",
        "Parameter 2 controls the left/right pan position of the input signal."
    ],
    "19": [
        "This algorithm is a stereo ping-pong delay/echo effect, primarily intended for processing audio signals, where the delay time is set from a clock pulse. It operates at a quarter of the standard sample rate (i.e. at about 19kHz) and offers a maximum delay time of about 900ms.",
        "Input X is the signal input. Any audio signal can be fed in here.",
        "Input Y is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the delay time. If the time between triggers is greater than the maximum delay time, the time is divided by two until it is small enough. This way, you always end up with a rhythmically useful delay time.",
        "Parameter 1 applies a multiplier to the delay time, according to the table above. The Z knob/CV controls the left/right pan position of the input signal.",
        "Outputs A & B are the left and right outputs respectively. If the output mode parameter is 0 (the default), they are a mix of the dry (undelayed) signal and the delay effect. The amount of delay in the mix rises in direct proportion to the amount of feedback. If the output mode parameter is 1, the outputs are the delayed signals only. Use this and the input signal, plus an external mixer, if you need more flexibility in the dry/wet balance than is offered by output mode 0.",
        "The delay feedback is set via parameter 0."
    ],
    "20": [
        "This algorithm implements a resonator, which is a kind of filter, but which is also often found as the basis for analogue drum synthesis.",
        "X is the input for the signal to filter. If used as a drum synth, this is the trigger input. The amplitude and nature of the trigger signal will affect the resulting sound.",
        "Y sets the pitch of the resonator, with a 1V/octave response. The 0V point for the pitch input is C3 (approximately 130.81Hz). Parameter 0 provides a pitch offset in semitones.",
        "Z sets the gain. In terms of drum synthesis, more gain means a longer decay time.",
        "A is the audio output.",
        "B outputs the result of envelope tracking the audio output A.",
        "Pressing Z simulates hitting X with a 1ms 5V pulse, and so works as a manual trigger of the 'drum'."
    ],
    "21": [
        "This algorithm implements a vocoder. The spectral characteristics of the modulator input are applied to the carrier input. In classic usage, the modulator might be a human voice, and the carrier might be a synth sound, or simply noise.",
        "X is the modulator input, and Y is the carrier input.",
        "A is the audio output. B outputs a CV related to the envelope of the modulator signal.",
        "The Z control sets the decay time of the internal envelope trackers, which track each band of the modulator signal. Use low values (negative Z) for most intelligible speech.",
        "Parameter 0 selects between alternative filter banks:",
        "0 Half octave spacing, based on 100Hz.",
        "1 Third octave spacing, based on 250Hz.",
        "Parameters 1 & 2 provide attenuation or gain of outputs A & B respectively."
    ],
    "22": [
        "This algorithm implements a phase shifter or 'phaser' effect.",
        "X is the audio input.",
        "Y is the sweep input. 0V to 8V covers the whole range; negative voltages are treated as 0V. You will almost always want to patch an LFO in here. Parameter 0 can be used to set this to a 'centre' value, which makes it easier to patch in an LFO to the Y input without having to add a DC offset to the LFO.",
        "Z controls feedback. More feedback results in more extreme phasing effects. When Z is negative, the feedback is inverted, which gives a different-sounding phasing effect.",
        "A outputs the combination of the phase-shifted signal and the original signal, which is usually what you need for a classic phaser effect, since it's the interaction of the original signal and the phase- shifted version which produces the 'comb filtering' effect.",
        "Output B provides just the phase shifted signal, if you need more contorl over how this and the original signal are mixed.",
        "Parameter 1 sets the number of phase shifting stages. The more stages, the more notches there are in the comb filter, which results in a more pronounced effect."
    ],
    "23": [
        "This algorithm is a 'bit crusher' - it applies sample rate and sample depth reduction to deliberately introduce quantisation and aliasing artefacts. It also optionally applies bitwise modification of the samples for non-linear distortion effects.",
        "X is the signal input.",
        "Y is the sample rate reduction CV input. It has a 1V/octave response i.e. the sample rate is reduced by a factor of 2 for every 1V rise in CV. This CV is offset by parameter 0, so you can set a rate reduction without a CV input.",
        "A is the signal output.",
        "B is the output of a comparator. Output A is compared against zero; output B is +5V if A is above zero, or 0V if A is below zero.",
        "The Z control sets the bit depth reduction. There are two types of bit reduction available:",
        "• Type I - the signal is quantised to a 16 bit word, and the low bits thrown away. The resulting signal uses a power of 2 bits. Changing between bit depths is therefore discontinous.",
        "• Type II - quantisation is achieved via the limited precision of integer maths when dividing the signal by a factor. Since the factor can be continuously varied, this offers a smooth variation between 'bit depths'.",
        "Furthermore, positive and negative values of Z have different effects.",
        "• Positive Z treats the whole signal range as one number to be quantised.",
        "• Negative Z treats positive and negative sections of the input signal differently. Negative sections are flipped positive, quantized, and flipped back.",
        "Parameter 1 selects the type of bit reduction. The positive and negative sections of the input signal can have different types of reduction applied.",
        "0 Type I Type I",
        "1 Type II Type II",
        "2 Type I Type II",
        "3 Type II Type I",
        "4 Type I None",
        "5 Type II None",
        "6 None Type I",
        "7 None Type II",
        "Parameter 2 selects the bit mangling mode.",
        "0 None",
        "1 Bit swap variant 1",
        "2 Bit swap variant 2",
        "3 Bit swap variant 3",
        "4 Bit rotation",
        "5 Previous sample XOR variant 1",
        "6 Previous sample XOR variant 2",
        "7 Previous sample XOR variant 3"
    ],
    "24": [
        "This is stereo filter which sweeps from lowpass to highpass on a single knob.",
        "The Z knob/CV sets the filter cutoff. At the central, zero position no filter effect is applied. If the knob is turned anticlockwise, a lowpass filter is applied, with a cutoff frequency that sweeps down the more you turn. If the knob is turned clockwise from centre, a highpass filter is applied, with a cutoff frequency that sweeps up the more you turn."
    ],
    "25": [
        "This is a delay/echo effect which simulates a variable speed tape loop echo device. The delay time at '1x speed', with the tape length parameter at maximum, is just over 400ms.",
        "X is the audio input.",
        "Parameters 0 & 1 together set the 'tape length', effectively setting the delay time. Parameter 0 is scaled in 10ms increments, while parameter 1 is in 1ms increments (both assuming 1x 'tape speed').",
        "Y controls the speed of the 'tape', which also affects the delay time. The voltage/speed relationship is 8V/octave. If you consider 0V as '1x speed', then +8V gives '2x speed' (the maximum) and -4V gives 'half speed' (the minimum). Parameter 2 can be used to set the speed manually; its value is added to that of the Y input.",
        "The Z knob/CV controls the feedback, from zero to slightly more than 100%. Outputs A & B carry signals according to parameter 3:",
        "0 A is mix; B is delay only.",
        "1 A & B are mix.",
        "2 A & B are delay only.",
        "'Mix' is a mix of the dry (undelayed) signal and the delay effect. The amount of delay in the mix rises in direct proportion to the amount of feedback.",
        "'Delay only' is the delayed signal only. Use this and the input signal, plus an external mixer, if you need more flexibility in the dry/wet balance than is offered by the mixed mode."
    ],
    "26": [
        "This algorithm recreates a popular analogue circuit variously known as a waveform animator or wave multiplier. Such a circuit, when given (typically) a sawtooth waveform as input, uses a comparator to generate a square wave of suitable phase and pulsewidth such that when the square and saw waves are added together the result is a phase shifted saw waveform. This is usually done a number of times and the results added with the overall effect of turning the original, rather plain, waveform into a much richer one which to all intents and purposes is the same as if you'd started with a number of VCOs rather than just one, and so sounds \"fatter\". In combination with LFOs varying the comparator thresholds, very rich textures can be generated.",
        "Here, four comparators and four LFOs are used. X is the audio input.",
        "The thresholds of the comparators are set by a combination of Y and Z. Y sets the 'centre' threshold; Z sets a 'spread' of the individual thresholds around the centre. Parameter 1 also sets the centre.",
        "Parameter 0 sets the LFO depth. Parameter 2 scales the LFO rates; the four LFOs have preset individual speeds, which the parameter multiplies.",
        "Parameter 3 sets the 'scale'. The recreation of phase shifted sawtooths works best when the square wave amplitude is matched to that of the saw. The default setting of -1 uses an envelope tracker to automatically set the square amplitude from the incoming audio. Other values directly set the amplitude (31 corresponds to ±8V). Fixing the amplitude of the square waves and varying the input signal's amplitude is a useful effect in its own right.",
        "Output A is the animated output (sum of the orignal signal and the comparator outputs). Output B is just the square waves."
    ],
    "27": [
        "This is a 2nd-order filter, with a voltage controllable response type. By varying Z, the output can be low pass, band pass or high pass, or blends in between.",
        "X is the audio input.",
        "Y sets the filter frequency, with a 1V/octave response. The 0V point is C3 (approximately 130.81Hz). Parameter 0 is added to the Y CV; its range of ±80 corresponds to ±5V.",
        "Z sets the filter type output at A & B.",
        "Output A blends smoothly between low pass (at minimum Z), through band pass (at zero Z), to high pass (at maximum Z).",
        "Output B blends smoothly between high pass (at minimum Z), through band pass (at zero Z), to low pass (at maximum Z).",
        "Parameter 1 sets the filter resonance."
    ],
    "28": [
        "This is a filter with simultaneous low pass and high pass outputs. X is the audio input.",
        "Y sets the filter frequency, with a 1V/octave response. The 0V point is C3 (approximately 130.81Hz). Parameter 0 is added to the Y CV; its range of ±80 corresponds to ±5V.",
        "Z controls the filter resonance."
    ],
    "29": [
        "This is a filter with simultaneous low pass and band pass outputs. X is the audio input.",
        "Y sets the filter frequency, with a 1V/octave response. The 0V point is C3 (approximately 130.81Hz). Parameter 0 is added to the Y CV; its range of ±80 corresponds to ±5V.",
        "Z controls the filter resonance."
    ],
    "30": [
        "This is a filter with simultaneous band pass and high pass outputs. X is the audio input.",
        "Y sets the filter frequency, with a 1V/octave response. The 0V point is C3 (approximately 130.81Hz). Parameter 0 is added to the Y CV; its range of ±80 corresponds to ±5V.",
        "Z controls the filter resonance."
    ],
    "31": [
        "This is a filter with simultaneous band pass and notch outputs.",
        "X is the audio input.",
        "Y sets the filter frequency, with a 1V/octave response. The 0V point is C3 (approximately 130.81Hz). Parameter 0 is added to the Y CV; its range of ±80 corresponds to ±5V.",
        "Z controls the filter resonance."
    ],
    "32": [
        "This algorithm is a two-stage (attack/release or attack/decay) envelope generator.",
        "Inputs X & Y are trigger inputs. A signal in excess of 1V on either input will trigger the envelope, according to the mode set by parameter 0. In trigger mode 0, the envelope will rise to full level and stay there as long as the input is high (AR mode). In trigger mode 1, the envelope will execute one full attack/decay cycle in response to a trigger input (AD mode). In trigger mode 2, the envelope will continually execute attack/decay cycles as long as the trigger is high (looped AD mode).",
        "Z sets the envelope times, according to the mode set by parameter 1. In Z mode 0, the full range of Z values sweeps from short A & D, through short A & long D, through long A & D, through long A & short D, and finally back to short A & D. In Z mode 1, Z sets the A & D times to the same value, from very short times (about 10ms) to very long times (about 8s).",
        "A & B both output the envelope CV. Each has its own attenuverter parameter, which can attenuate and/or invert the signal. The maximum envelope level is 10V, with the default parameter value of 32 giving an 8V envelope. Each output also has an offset parameter, which can move the whole envelope up or down by up to 10V.",
        "If parameter 2 is set to the special value 41, output A becomes an end-of-cycle trigger output, generating a 10ms 5V pulse at the end of the envelope's release stage.",
        "Parameters 6 & 7 set the attack and release shapes of the envelope respectively, from an exaggerated exponential curve at 0 to an almost linear shape at 32.",
        "Pushing the Z knob has the same effect as triggering the envelope via the X or Y inputs."
    ],
    "33": [
        "This algorithm is a combined two-stage (attack/release or attack/decay) envelope generator & VCA (voltage controlled amplifier).",
        "Input X is the trigger input. A signal in excess of 1V will trigger the envelope, according to the mode set by parameter 0. In trigger mode 0, the envelope will rise to full level and stay there as long as the input is high (AR mode). In trigger mode 1, the envelope will execute one full attack/decay cycle in response to a trigger input (AD mode). In trigger mode 2, the envelope will continually execute attack/decay cycles as long as the trigger is high (looped AD mode).",
        "Input Y is the VCA input. The signal here will be multiplied by the envelope and output on output B.",
        "Z sets the envelope times, according to the mode set by parameter 1. In Z mode 0, the full range of Z values sweeps from short A & D, through short A & long D, through long A & D, through long A & short D, and finally back to short A & D. In Z mode 1, Z sets the A & D times to the same value, from very short times (about 10ms) to very long times (about 8s).",
        "Output A is the envelope CV, and output B is the VCA output as mentioned above. Each has its own attenuverter parameter, which can attenuate and/or invert the signal. The maximum envelope level is 10V, with the default parameter value of 32 giving an 8V envelope, which corresponds to unity gain for the VCA. Each output also has an offset parameter, which can move the whole envelope up or down by up to 10V.",
        "If parameter 2 is set to the special value 41, output A becomes an end-of-cycle trigger output, generating a 10ms 5V pulse at the end of the envelope's release stage.",
        "Parameters 6 & 7 set the attack and release shapes of the envelope respectively, from an exaggerated exponential curve at 0 to an almost linear shape at 32.",
        "Pushing the Z knob has the same effect as triggering the envelope via the X input."
    ],
    "34": [
        "This algorithm offers dual two-stage (attack/release or attack/decay) envelope generators, with shared time settings.",
        "Inputs X & Y are trigger inputs. A signal in excess of 1V on either input will trigger its respective envelope, according to the mode set by parameter 0. In trigger mode 0, the envelope will rise to full level and stay there as long as the input is high (AR mode). In trigger mode 1, the envelope will execute one full attack/decay cycle in response to a trigger input (AD mode). In trigger mode 2, the envelope will continually execute attack/decay cycles as long as the trigger is high (looped AD mode).",
        "Z sets the envelope times, according to the mode set by parameter 1. In Z mode 0, the full range of Z values sweeps from short A & D, through short A & long D, through long A & D, through long A & short D, and finally back to short A & D. In Z mode 1, Z sets the A & D times to the same value, from very short times (about 10ms) to very long times (about 8s).",
        "A & B are the envelope CV outputs. Each has its own attenuverter parameter, which can attenuate and/or invert the signal. The maximum envelope level is 8V. Each output also has an offset parameter, which can move the whole envelope up or down by up to 8V.",
        "Parameters 6 & 7 set the attack and release shapes of the envelope respectively, from an exaggerated exponential curve at 0 to an almost linear shape at 32.",
        "Pushing the Z knob has the same effect as triggering both envelopes via the X & Y inputs."
    ],
    "35": [
        "This algorithm implements a fairly traditional stereo compressor.",
        "X & Y are the stereo audio inputs; A & B are the stereo audio outputs.",
        "The Z knob/CV sets the compression ratio, from 1 (no compression) at fully counterclockwise, to infinity (effectively limiting rather than compression) at fully clockwise.",
        "Parameter 0 sets the threshold level above which compression applies (in dB).",
        "Parameters 1 & 2 set the attack and release times. The attack time range is approximately 0.1ms-1s; the release time range is approximately 1ms-3s.",
        "Parameter 3 sets the make-up gain (in dB). If set to -1, the make-up gain is calculated automatically from the threshold and compression ratio.",
        "Parameter 4 sets a lookahead time, effectively delaying the audio slightly relative to the envelope detection. This can be used to ensure that sharp transients are not lost during the attack time of the envelope. The maximum lookahead is about 10ms."
    ],
    "36": [
        "This algorithm is much the same as E-4 Stereo Compressor above, except that the gain reduction is driven not by the audio signal itself, but by a side-chain input. Refer to the description of E-4 for explanation of the common parameters not detailed below.",
        "The Z knob/CV is the side-chain input. If you're using an audio signal here, you'll want to set the knob to its central (un-illuminated) position first. However, you can also use Z with any CV to control the gain reduction directly.",
        "Parameter 5 sets the compression ratio, with a range from 1 (no compression) to infinity (effectively limiting rather than compression)."
    ],
    "37": [
        "This algorithm implements a mono compressor with side-chain input.",
        "X is the audio input; A is the audio output.",
        "Y is the side-chain input, which drives the compression amount applied to the audio signal on X. The B output provides a CV reflecting the amount of gain reduction being applied.",
        "The Z knob/CV sets the compression ratio, from 1 (no compression) at fully counterclockwise, to infinity (effectively limiting rather than compression) at fully clockwise. Parameter 0 sets the threshold level above which compression applies (in dB).",
        "Parameters 1 & 2 set the attack and release times. The attack time range is approximately 0.1ms-1s; the release time range is approximately 1ms-3s.",
        "Parameter 3 sets the make-up gain (in dB). If set to -1, the make-up gain is calculated automatically from the threshold and compression ratio.",
        "Parameter 4 sets a lookahead time, effectively delaying the audio slightly relative to the envelope detection. This can be used to ensure that sharp transients are not lost during the attack time of the envelope. The maximum lookahead is about 10ms."
    ],
    "38": [
        "This algorithm was designed for interfacing Eurorack (or more generally, any analogue synths using the 1V/octave standard) with Buchla synths, though it has options to cater for other, non-standard formats.",
        "Input X/Output A convert a pitch CV from the 1V/octave standard to the 1.2V/octave standard by default. The exact scaling is set by parameters 1 & 2:",
        "scale = 1.0 + 0.002 * ( parameter 1 ) + 0.0002 * ( parameters 2 )",
        "Input Y is a gate input, triggering when the level exceeds 1V. From this, a Buchla-format combined gate & trigger is generated from output B. This is a 4ms pulse at 10V, followed by a sustained gate at 5V.",
        "The Z knob/CV provides a tuning control, with a range of approximately ±0.5 octaves.",
        "Parameter 0 shifts the X input by whole octaves, equivalent to adding a whole number of Volts to the X CV.",
        "Parameter 3 applies an offset in mV to the A output.",
        "Parameter 4 sets the gate level as (1+the parameter value)% of the 10V trigger pulse. The default value of 49 therefore gives a 50% gate level i.e. 5V."
    ],
    "39": [
        "This algorithm is for interfacing Buchla synths with Eurorack (or more generally, any analogue synths using the 1V/octave standard).",
        "Input X/Output A convert a pitch CV from the 1.2V/octave standard to the 1V/octave standard.",
        "Input Y is intended to receive a Buchla-format combined trigger & gate signal (typically a 10V trigger pulse followed by a sustained 5V gate). From this, output B generates just the trigger pulse (at 5V). If you need the gate signal, you can directly use the Buchla output.",
        "The Z knob/CV provides a tuning control, with a range of approximately ±0.5 octaves."
    ],
    "40": [
        "This algorithm is a two-stage (attack/decay) envelope generator, whose overall time is set from an input clock pulse. The envelope is continuously output (starting on each new clock pulse) unless muted.",
        "Input X is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the envelope time.",
        "Parameter 0 applies a multiplier to the envelope time, according to the table above.",
        "Input Y is a mute input. While this input is over 1V, the output is forced to 0V.",
        "Z sets the envelope shape, from short attack & long decay, to long attack and short decay.",
        "Parameters 3 & 4 set the attack and decay shapes of the envelope respectively, from an exaggerated exponential curve at 0 to an almost linear shape at 32.",
        "A & B both output the envelope CV. Parameters 1 & 2 are attenuverters, which can attenuate and/or invert the signal for each output independently. The unattenuated envelope level is 8V.",
        "If parameter 1 is set to the special value 41, output A becomes an end-of-cycle trigger output, generating a 10ms 5V pulse at the end of the envelope's release stage."
    ],
    "41": [
        "This algorithm is a two-stage (attack/decay) envelope generator, whose overall time is set from an input clock pulse. The envelope is continuously output (starting on each new clock pulse) while enabled by the gate.",
        "Input X is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the envelope time.",
        "Parameter 0 applies a multiplier to the envelope time, according to the table above.",
        "Input Y is a gate input. While this input is below 1V, the output is forced to 0V.",
        "Z sets the envelope shape, from short attack & long decay, to long attack and short decay.",
        "Parameters 3 & 4 set the attack and decay shapes of the envelope respectively, from an exaggerated exponential curve at 0 to an almost linear shape at 32.",
        "A & B both output the envelope CV. Parameters 1 & 2 are attenuverters, which can attenuate and/or invert the signal for each output independently. The unattenuated envelope level is 8V.",
        "If parameter 1 is set to the special value 41, output A becomes an end-of-cycle trigger output, generating a 10ms 5V pulse at the end of the envelope's release stage."
    ],
    "42": [
        "This algorithm is a two-stage (attack/decay) envelope generator, whose overall time is set from an input clock pulse. The envelope is triggered by a separate trigger pulse.",
        "Input X is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the envelope time.",
        "Parameter 0 applies a multiplier to the envelope time, according to the table above.",
        "Input Y is a trigger input. Any clock pulse in excess of 1V can be used. A rising clock pulse triggers the envelope.",
        "Z sets the envelope shape, from short attack & long decay, to long attack and short decay.",
        "Parameters 3 & 4 set the attack and decay shapes of the envelope respectively, from an exaggerated exponential curve at 0 to an almost linear shape at 32.",
        "A & B both output the envelope CV. Parameters 1 & 2 are attenuverters, which can attenuate and/or invert the signal for each output independently. The unattenuated envelope level is 8V.",
        "If parameter 1 is set to the special value 41, output A becomes an end-of-cycle trigger output, generating a 10ms 5V pulse at the end of the envelope's release stage."
    ],
    "43": [
        "This algorithm is a two-stage (attack/decay) envelope generator, whose overall time is set from an input clock pulse. The envelope is continuously output (starting on each new clock pulse). This algorithm also offers a VCA (voltage controlled amplifier) function.",
        "Input X is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the envelope time.",
        "Parameter 0 applies a multiplier to the envelope time, according to the table above.",
        "Input Y is the VCA input. The signal here will be multiplied by the envelope and output on output B.",
        "Z sets the envelope shape, from short attack & long decay, to long attack and short decay.",
        "Parameters 3 & 4 set the attack and decay shapes of the envelope respectively, from an exaggerated exponential curve at 0 to an almost linear shape at 32.",
        "Output A is the envelope CV, and output B is the VCA output as mentioned above. Parameters 1 & 2 are attenuverters, which can attenuate and/or invert the signal for each output independently. The unattenuated envelope level is 8V; output B is unity gain with respect to input Y if unattenuated.",
        "If parameter 1 is set to the special value 41, output A becomes an end-of-cycle trigger output, generating a 10ms 5V pulse at the end of the envelope's release stage."
    ],
    "44": [
        "This algorithm generates random CVs via the popular rotating shift register method. The joy of this method is that it generates a loop of CVs, with a controllable likelihood of change, including the possibility to lock the loop so it does not change.",
        "X is the clock input. Any clock pulse in excess of 1V can be used. On each rising edge the shift register rotates and a new CV is output. On each rotation, there is the possibility that one bit of the shift register will be flipped, changing the pattern. The likelihood of a flip is set by Z. When Z is zero there is a 50% chance that the bit will flip, which is the most random setting. As Z rises, the chance of a flip reduces, until at around 2V the chance of a flip hits zero and the pattern is effectively locked. Conversely, as Z goes negative, the chance of a flip goes up, reaching 100% at around -2V. This also effectively locks the pattern. When Z crosses the ±2V boundaries, in either direction, the display shows \"**\" for a short while to let you know that the pattern has been locked or unlocked.",
        "Input Y allows for modification of the sequence, even when the loop is locked. If input Y is above 1V, the bit will always be flipped on a clock pulse, regardless of the setting of Z.",
        "Output A is the random pattern interpreted as a unipolar CV i.e. it is always a positive voltage. Output B is the random pattern interpreted as a bipolar CV i.e. it can swing both positive and negative.",
        "Parameter 0 sets the direction of rotation. The two directions have a different sound to the patterns they tend to generate.",
        "Parameter 1 sets the length of the shift register, and so the length of the repeating CV pattern in terms of clocks.",
        "Parameter 2 sets the output slew rate. This has the same effect as the Slew Rate Limiter algorithm being applied to the outputs.",
        "Parameter 3 is an attenuverter for both outputs. Parameter 4 is an offset for both outputs."
    ],
    "45": [
        "This algorithm generates random CVs via the popular rotating shift register method. The joy of this method is that it generates a loop of CVs, with a controllable likelihood of change, including the possibility to lock the loop so it does not change. The CVs are quantized to semitones or to a chosen musical scale.",
        "X is the clock input. Any clock pulse in excess of 1V can be used. On each rising edge the shift register rotates and a new CV is output. On each rotation, there is the possibility that one bit of the shift register will be flipped, changing the pattern. The likelihood of a flip is set by Z. When Z is zero there is a 50% chance that the bit will flip, which is the most random setting. As Z rises, the chance of a flip reduces, until at around 2V the chance of a flip hits zero and the pattern is effectively locked. Conversely, as Z goes negative, the chance of a flip goes up, reaching 100% at around -2V. This also effectively locks the pattern. When Z crosses the ±2V boundaries, in either direction, the display shows \"**\" for a short while to let you know that the pattern has been locked or unlocked.",
        "Input Y allows for modification of the sequence, even when the loop is locked. If input Y is above 1V, the bit will always be flipped on a clock pulse, regardless of the setting of Z.",
        "Output A is the random pattern of CVs, quantized to the scale chosen via parameter 2. The list of scales is the same as that for the Quantizer algorithm, above.",
        "Output B is a trigger output.",
        "Parameter 0 sets the direction of rotation. The two directions have a different sound to the patterns they tend to generate.",
        "Parameter 1 sets the length of the shift register, and so the length of the repeating CV pattern in terms of clocks.",
        "Parameter 3 is an attenuverter for the random CV, applied before quantization. Parameter 4 is a transpose amount, in semitones, applied after quantization.",
        "MIDI Output: each new note (i.e. when the Output B trigger fires) is output as a MIDI note message on the MIDI channel selected in the settings.",
        "The MIDI Gate parameter works in the same way as for the Quantizer, above."
    ],
    "46": [
        "This algorithm generates random triggers via the popular rotating shift register method. The joy of this method is that it generates a loop of triggers, with a controllable likelihood of change, including the possibility to lock the loop so it does not change.",
        "X is the clock input. Any clock pulse in excess of 1V can be used. On each rising edge the shift register rotates and a new CV is output. On each rotation, there is the possibility that one bit of the shift register will be flipped, changing the pattern. The likelihood of a flip is set by Z. When Z is zero there is a 50% chance that the bit will flip, which is the most random setting. As Z rises, the chance of a flip reduces, until at around 2V the chance of a flip hits zero and the pattern is effectively locked. Conversely, as Z goes negative, the chance of a flip goes up, reaching 100% at around -2V. This also effectively locks the pattern. When Z crosses the ±2V boundaries, in either direction, the display shows \"**\" for a short while to let you know that the pattern has been locked or unlocked.",
        "Input Y allows for modification of the sequence, even when the loop is locked. If input Y is above 1V, the bit will always be flipped on a clock pulse, regardless of the setting of Z.",
        "Output A is the random pattern of triggers. A trigger is emitted for every bit set in the shift register. Output B is the inverse of A - a trigger is generated for every bit not set in the shift register.",
        "Parameter 0 sets the length of the shift register, and so the length of the repeating trigger pattern in terms of clocks."
    ],
    "47": [
        "This algorithm generates random triggers via the popular rotating shift register method. The joy of this method is that it generates a loop of triggers, with a controllable likelihood of change, including the possibility to lock the loop so it does not change. In this algorithm there are two shift registers for the two outputs, which share a common clock.",
        "X is the clock input. Any clock pulse in excess of 1V can be used. On each rising edge the shift register rotates and a new CV is output. On each rotation, there is the possibility that one bit of the shift register will be flipped, changing the pattern. The likelihood of a flip is set by Z. When Z is zero there is a 50% chance that the bit will flip, which is the most random setting. As Z rises, the chance of a flip reduces, until at around 2V the chance of a flip hits zero and the pattern is effectively locked. Conversely, as Z goes negative, the chance of a flip goes up, reaching 100% at around -2V. This also effectively locks the pattern. When Z crosses the ±2V boundaries, in either direction, the display shows \"**\" for a short while to let you know that the pattern has been locked or unlocked.",
        "Input Y allows for modification of the sequence, even when the loop is locked. If input Y is above 1V, the bit will always be flipped on a clock pulse, regardless of the setting of Z.",
        "Output A & B are the random patterns of triggers. A trigger is emitted on each output for every bit set in that output's shift register.",
        "Parameters 0 & 1 set the length of the shift registers, and so the length of the repeating trigger patterns in terms of clocks."
    ],
    "48": [
        "This algorithm provides a software implementation of the Expert Sleepers ES-1 module. The in conjunction with the Silent Way AC Encoder plug-in this allows you to pass CVs from your DAW to your modular via an AC coupled audio interface.",
        "X & Y are the two inputs - connect these to outputs from your audio interface.",
        "A & B are the corresponding outputs - connect these to CV inputs in your modular.",
        "Z provides a trim control. Adjust this so that a zero CV entering the AC Encoder plug-in gives you a zero CV out of the disting (either with a voltmeter, or by eye, just looking at the colour of the disting's output jacks)."
    ],
    "49": [
        "This algorithm provides a software implementation of the Expert Sleepers ES-2 module. The in conjunction with the Silent Way CV Input plug-in this allows you to pass CVs from your modular into your DAW via a regular audio interface.",
        "X & Y are the two inputs - connect these to CV outputs from your modular.",
        "A & B are the corresponding outputs - connect these to inputs on your audio interface.",
        "Z provides a trim control, allowing adjustment of the ES-2's operating frequency. Start with this at zero (LEDs off) and adjust to minimise noise in the CV recovered from the plug-in."
    ],
    "50": [
        "Generates sine and square waves at a fixed pitch, specified by the parameters. Z sets the amplitude of the outputs.",
        "When the pitch is changed, the note name is scrolled across the display, first as a normal name (e.g. 'C#4') and then as a MIDI note number (e.g. 61)."
    ],
    "51": [
        "Generates sine and square waves at a fixed frequency, specified in Hz.",
        "Z sets the amplitude of the outputs.",
        "When the pitch is changed, the frequency is scrolled across the display (e.g. '440Hz').",
        "This algorithm uses an interface unlike any other, in order to be able to set the digits of the frequency individually. It is somewhat like the usual parameters interface, in that pressing Z advances through the digits, and turning S changes the values.",
        "When S is turned, a pair of digits is displayed. The first is the decimal place that is being edited in the frequency value e.g. '0' is ones, '1' is tens, '2' is hundreds and so on. The second digit is the value of that digit within the frequency value.",
        "Pressing Z advances the decimal place, and displays a pair of digits as above representing that new part of the frequency value, which can then be edited with S."
    ],
    "52": [
        "This algorithm provides a chromatic tuner. The pitch of the input signal is tracked and displayed as a note name, with indication of whether the note is sharp or flat.",
        "Natural notes are shown in capitals i.e. 'C', 'D', 'E' etc. Lower case letters indicate sharps e.g. 'c' indicates C sharp, 'd', indicates D sharp.",
        "Following the note name a '-' indicates that the note is below the true pitch (flat) and '+' indicates that the note is above the true pitch (sharp). If the note is within 1 cent of the true pitch, neither '-' nor '+' is shown.",
        "Output A is a copy of X, so the tuner can be left inline without needing a mult.",
        "Output B is a sine wave at the pitch of the detected note. The amplitude of the sine wave is set by the Z knob/CV."
    ],
    "53": [
        "This algorithm converts clocks between MIDI clocks, analogue clocks and an internal timebase, in any combination. The mode of operation is determined by parameter 0.",
        "The internal clock is started & stopped by pushing the Z knob. There are two choices, set by parameter 6: a tempo-based clock or a tap tempo clock.",
        "0 - Start/Stop",
        "Push Z to start the internal clock; push it again to stop the clock. Parameter 5 sets the tempo, as 120 plus the parameter value (i.e. the range is 0-240 bpm).",
        "1 - Tap Tempo",
        "Push Z five times to start the clock (i.e. a one bar count-in in 4 time). Hold Z for 2 seconds to stop the clock. While the clock is running, you may continue to tap Z to correct or change the tempo.",
        "Whatever the clock source, outputs A & B generate 5V clock pulses according to parameters 1 & 2. The parameter/divisor relationship is as per the following table:",
        "-2\tRun/stop",
        "-1\tReset pulse",
        "0\t1/32",
        "1\t1/24",
        "2\t1/16",
        "3\t1/12",
        "4\t1/8",
        "5\t1/6",
        "6\t1/4",
        "7\t1/3",
        "8\t1/2",
        "9\t1/1",
        "10\t2/1",
        "11\t3/1",
        "12\t4/1",
        "In modes that use it, input X is a clock input, with a threshold of 1V. Parameter 3 sets the interpretation of X according to the following table:",
        "0\t1/96",
        "1\t1/48",
        "2\t1/32",
        "3\t1/24",
        "4\t1/16",
        "5\t1/12",
        "6\t1/8",
        "7\t1/6",
        "8\t1/4",
        "9\t1/3",
        "10\t1/2",
        "11\t1/1",
        "Parameter 4 controls whether input Y is used as a run/stop input:",
        "0 - Not used. - The X clock is taken to start as soon as pulses appear on the X input, and is assumed to have stopped if no pulses appear for two seconds.",
        "1 - Run/stop for X. - The X clock is ignored until Y goes high (over 1V) and stops when Y goes low.",
        "2 - Run/stop for internal. - The internal clock starts when Y goes high and stops when Y goes low.",
        "3 - Run/stop for both. - Both the X clock and the internal clock are controlled by Y as above."
    ],
    "54": [
        "Performs a MIDI to CV conversion on MIDI notes arriving on the disting's MIDI port.",
        "Output A is the pitch CV output; output B is the gate output.",
        "Outputs A & B can also be controlled directly via MIDI CCs 33 & 34 respectively (the CC range of 0-127 is mapped to -5V to +5V), or via MIDI CCs 35 & 36 (the CC range of 0-127 is mapped to 0V to 10V).",
        "The received MIDI channel is selected in the settings.",
        "Parameter 2 selects a scale to use, if any are provided on the SD card. See “Scala Support” above. The default value of -1 disables this function.",
        "Parameter 3 enables a 'fingered portamento' effect, that is, a glide from one note to the next if they are played legato. Higher parameter values give a slower glide."
    ],
    "55": [
        "Generates MIDI notes (on the MIDI channel selected in the settings) from the pitch and gate CVs on the X & Y inputs.",
        "Parameter 0 sets an offset between the timing of the X & Y inputs (in sample frames). It is generally a good idea to delay the pitch slightly relative to the gate, to ensure that the pitch has changed and settled before the gate triggers a new note.",
        "Parameter 1 chooses the function of the Z knob/CV. If 0, Z sets the velocity of the generated MIDI notes. If 1, Z generates CC 1 (mod wheel) messages, and the note velocity is fixed at 64."
    ],
    "56": [
        "Viewed as a stereo output, A & B provide a panned version of X, plus an oppositely panned version of Y.",
        "Viewed as mono outputs, A provides a crossfaded mix of X & Y, while B provides a mix with an inverted mix control.",
        "In both cases Z provides the pan position or crossfade amount. When Z is turned, the crossfade position is displayed as a percentage (so 50% is an equal mix of the two sources/centre pan).",
        "Parameter 0 sets the pan/crossfade law:",
        "0 Equal gain Appropriate for crossfading phase-coherent material.",
        "1 Equal power Appropriate for crossfading non-phase-coherent material.",
        "2 Transition DJ-style crossfade where both sources are at full gain at the 50% position.",
        "3 FX Loop Output A is unattenuated input X plus a faded amount of input Y.",
        "Parameter 1 sets the clipping/saturation mode, for when the mix of the inputs exceeds the dynamic range of the output:",
        "0 Legacy The behaviour pre-firmware 4.8, which could cause digital overflows and fairly drastic wavefolding-type sounds.",
        "1 Hard clip A hard digital clip is applied.",
        "2 Soft clip A soft clip/saturation is applied.",
        "Parameter 2 controls the function of output B:",
        "-1 Copy Output B follows input X.",
        "0 Normal Normal crossfade/pan function.",
        "1-99 LFO Output B is a ±5V triangle wave LFO, the speed of which is set from the parameter.",
        "Parameter 3 attenuates output B (in all modes).",
        "FX Loop usage: A combination of parameters 0 and 2 can be used to set up the disting as an effect loop controller, to integrate external effect units (e.g. pedals, rack processors) into the modular.",
        "Use input X as the main signal input. Setting parameter 2 to -1 makes output B a copy of the input, attenuated by parameter 3, which can be sent to the effects unit.",
        "Return the effected signal to input Y. There are then two options for how you want to mix in the effect. With parameter 0 at 0, 1, or 2, the Z knob/CV gives you a wet/dry mix control. With parameter 0 at 3, the amount of input X in the mix is constant, so Z gives you a simple fader on the effect return."
    ],
    "57": [
        "If parameter 0 is 0 (the default): Output A is a sample of input X, taken when the trigger input Z goes over 1V. (Sample and Hold)",
        "If parameter 0 is 1: Output A follows input X while input Z is over 1V. When Z falls below 0.5V, output A is held until Z goes over 1V again. (Track and Hold)",
        "Similarly for output B/input Y.",
        "Pressing the Z knob triggers a sample manually.",
        "Parameter 1 sets an offset between the timing of the X/Y & Z inputs (in sample frames). If X/Y & Z are being driven together, for example by a sequencer's pitch and gate, it is often a good idea to delay the trigger slightly to allow time for the sampled CV to settle before the sample is taken.",
        "Parameters 2 & 3 add white noise into the signal from inputs X & Y respectively, allowing you to use the algorithm as a source of random voltages without having to patch anything into the inputs.",
        "Parameters 4 & 5 control the amount of slew applied to outputs A & B respectively."
    ],
    "58": [
        "Output A is a quantized version of input X; the closest whole-semitone value to the unquantized V/octave pitch CV X. Similarly output B is a quantized version of input Y.",
        "As well as providing a chromatic scale, this algorithm can also constrain the quantized values to a musical scale or chord. This is controlled by the Z knob/CV.",
        "When Z changes, the scale is displayed on the LEDs. The scale's number in the following table is shown, and after a short pause, the scale's name.",
        "0 chromatic",
        "1 major scale",
        "2 minor scale",
        "3 major triad",
        "4 minor triad",
        "5 root+5th",
        "6 major triad+6th",
        "7 minor triad+6th",
        "8 major triad+7th",
        "9 minor triad+7th",
        "10 root+5th+6th",
        "11 root+5th+7th",
        "12 pentatonic major",
        "13 pentatonic minor",
        "14 natural minor scale",
        "15 harmonic minor scale",
        "For each quantizer, a parameter provides a transpose control. The transposition is applied to the input before it is forced into the chosen scale i.e. the transposition moves the notes around within the same key.",
        "MIDI Output: each new note is output as a MIDI note message on the MIDI channel selected in the settings (input X/output A) or on the next highest channel (input Y/output B). E.g. if the settings specify MIDI channel 4, the notes are output on channels 4 (X/A) and 5 (Y/B)."
    ],
    "59": [
        "Output A is a quantized version of input X; the closest whole-semitone value to the unquantized V/octave pitch CV X. Similarly output B is a quantized version of input Y.",
        "As well as providing a chromatic scale, this algorithm can also constrain the quantized values to a musical scale or chord. This is controlled by parameters 2 & 3.",
        "0, ±1\tchromatic",
        "±2\tmajor scale",
        "±3\tminor scale",
        "±4\tmajor triad",
        "±5\tminor triad",
        "±6\troot +5th",
        "±7\tmajor triad +6th",
        "±8\tminor triad +6th",
        "±9\tmajor triad +7th",
        "±10\tminor triad +7th",
        "±11\troot +5th +6th",
        "±12\troot +5th +7th",
        "±13\tpentatonic major",
        "±14\tpentatonic minor",
        "±15\tnatural minor",
        "±16\tharmonic minor",
        "±17\tMIDI 1",
        "±18\tMIDI 2",
        "Additionally, the parameter being positive or negative controls whether the quantizer works in triggered mode or not. The triggers are provided by input Z (approximately 1V is required to trigger it). If the parameter is negative, the quantizer is triggered - the input is only sampled and converted to a new quantized value when triggered by input Z. If the parameter is positive, the input is constantly sampled and a new note is output as soon as the input moves into the next semitone range.",
        "If the scale selected is 'MIDI 1' or 'MIDI 2' (values 17 & 18) the candidate notes for quantization are set via MIDI. The algorithm listens for MIDI note on messages and uses the received notes for the quantization pattern. While any notes are held, playing new notes adds to the pattern. When all notes are released and a new note played, the pattern is reset and formed from the new note.",
        "In 'MIDI 1' mode the played MIDI notes set the note names, but quantization can happen in any octave (i.e. if you play a 'D' the output will always be 'D' but the octave will depend on the octave of the incoming CV).",
        "In 'MIDI 2' mode the played MIDI notes are the only ones that can be output (so say if you play middle C and the D above, the output will always be one of those two notes, depending on whether the input CV is below or above middle C).",
        "MIDI Output: each new note is output as a MIDI note message on the MIDI channel selected in the settings (input X/output A) or on the next highest channel (input Y/output B). E.g. if the settings specify MIDI channel 4, the notes are output on channels 4 (X/A) and 5 (Y/B).",
        "The MIDI Gate parameter works in the same way as for the Quantizer, above."
    ],
    "60": [
        "This algorithm generates rhythmic patterns of output pulses known as Euclidean patterns. For a detailed description of these patterns and how they are commonly found in music around the world.",
        "A pattern is described by the total number of steps (controlled by parameter 0) and the number of pulses (i.e. the number steps on which a pulse is output) (controlled by parameter 1 for output A and by Z for output B).",
        "Parameter 2 sets a 'rotation' of the pattern. At zero rotation, the first step in the pattern will always be a pulse, and the remaining pulses distributed according to the algorithm. The rotation setting moves the first pulse by a number of steps i.e. moves the down beat.",
        "The two patterns can use the same rotation value, or independent values. If parameter 4 is -1, pattern 2 shares the rotation value set by parameter 2. Otherwise, it uses the rotation set by parameter 4.",
        "Parameter 3 sets the length of the output pulse. At zero, the pulse is a fixed length of 10ms. Values of 1-31 set the pulse length to a fraction of the clock time.",
        "Parameter 5 sets the overall repeat count i.e. the number of clocks until the pattern repeats. If this is zero, the number of steps (parameter 0) is used as the repeat. If the repeat count is greater than the number of steps, the pattern is extended with silence.",
        "Input X is the clock input, advancing the pattern by one step each time the input exceeds 1V. Input Y is a reset input, resetting the pattern to step 1."
    ],
    "61": [
        "Outputs A & B are pulse generators (0-5V) triggered by inputs X & Y respectively (1V required to trigger). The delay between the trigger and the output pulse, and the length of the pulse, can both be controlled.",
        "Unless in a mode where they are set by the Z input/CV, the delay and length are set from parameters 2 & 3. Parameter 1 provides a range control, which scales both the delay and length times. When the range parameter is 0, the maximum time is 10ms. Higher settings for range progressively double the maximum time; at the maximum ranage setting of 12, the maximum time is therefore 40.96s.",
        "Parameter 0 controls the function of Z:",
        "0 Z controls delay",
        "1 Z controls length",
        "2 Output override (high). Z over 1V forces both outputs high.",
        "3 Output override (low). Z over 1V forces both outputs low.",
        "4 Input enable. Z below 1V disables input triggers.",
        "5 Input disable. Z above 1V disables input triggers.",
        "6 Z is an additional trigger input which triggers both outputs."
    ],
    "62": [
        "Dual output variable-colour noise generator, with two optional VCAs.",
        "Outputs A and B are noise, with colour according to the parameter values:",
        "-1 Blended",
        "0 Violet",
        "1 White",
        "2 Pink",
        "3 Red",
        "If 'blended' is chosen, the noise colour can be smoothly swept from violet to red with the Z knob/CV .",
        "Parameters 2 & 3 set the attenuation of the outputs (31 corresponds to ±8V output for white noise). If the parameter is set to -1, the corresponding X/Y input is used to set the output amplitude (equivalent to following the noise output with a VCA driven by X/Y). The X/Y inputs are clamped at 0V i.e. negative input voltages yield silence."
    ],
    "63": [
        "The imaginatively-named Quantizer 2 algorithm offers pitch quantization to musical scales, with real-time user control over the notes in the scale to quantize to, and with two CV outputs that can be offset by a musical interval (e.g. a third, a fifth, an octave etc.).",
        "X is the pitch CV input. Parameter 3 allows you to attenuate the signal before it is quantized.",
        "Y is either a second pitch CV input, simply added to X, or a trigger input. When it is a pitch input, it is added to X after X has been attenuated – the attenuation parameter does not affect Y.",
        "Parameter 4 controls the function of Y. When the parameter is in the range -32 to 0, Y is a CV input, attenuated by the parameter (so -32 means no attenuation, -16 means 50%, and 0 means complete attenuation). When the parameter is 1-32 Y is a trigger input, and the parameter defines an offset (in sample frames) between the timing of the X & Y inputs. It is often a good idea to delay the trigger slightly relative to the pitch, to ensure that the pitch has changed and settled before the trigger samples a new note.",
        "A & B are the quantized pitch CV outputs. The Z knob/CV controls an interval between the two CVs, applied to output B. The interval is specified in scale degrees, so for example '3' is a third, and '8' is an octave. 'U' is displayed for unison. Note that this is not simply a constant voltage offset between the outputs – the voltage difference changes according to the position in the scale. For example, if the interval is a third, in C major, and output A is C (0V), then output B will be E (0.333V, a difference of 0.333V); if output A is D (0.167V), output B will be F (0.417V, a difference of 0.25V).",
        "Parameter 5 sets a slew rate for both outputs. At a value of 0 there is no slew; larger values apply increasingly more slew.",
        "Parameter 1 chooses the scale. The available options are:",
        "0 Major",
        "1 Natural Minor",
        "2 Harmonic Minor",
        "Parameter 2 sets the key to quantize into. The displayed key names assume that 0V pitch CV corresponds to the note C. The parameter value does not represent semitones, but degrees around the circle of fifths. Equivalently, the parameter indicates the number of sharps or flats.",
        "Parameter 0 defines the quantizer pattern – the selection of notes from the scale that are available for the CV to adopt. The user interface to editing the pattern is unique to this algorithm. When parameter 0 is the current parameter, turning the S knob scrolls through the degrees of the scale e.g. from 1 to 7 for a major scale. (The actual notes that these scale degrees refer to depend on the selected key and scale.) Next to the number of the scale degree is either a '+', which indicates the degree is included in the quantizer pattern, or '.', which indicates that it is not. Pressing the S knob toggles between these two states.",
        "When the display is not showing a parameter value or name, it shows the note name of the pitch CV on output A (assuming, as mentioned above, that 0V corresponds to a C).",
        "MIDI Input: MIDI note messages received on MIDI channel 1 or 2 set the quantizer pattern. The notes of the C major scale (i.e. the white keys) turn on & off the corresponding degrees of the pattern. Note that C major is always used for the MIDI input, regardless of which key the quantizer is actually working in. The octave of the MIDI notes makes no difference. How the notes control the pattern depends on the MIDI channel:",
        "- MIDI channel 1: A note on message toggles the state of the degree in the pattern on or off.",
        "– MIDI channel 2: The pattern is set from the notes currently being held down."
    ],
    "64": [
        "This algorithm continuously plays audio files, in a manner very much inspired by Tom Whitwell's Radio Music module.",
        "The current audio file is selected with the Z knob/CV. It plays, forever, at its natural speed (see the algorithms below if you want to control the speed), looping when it gets to the end; or it plays until the end of the file and stops, depending on the 'loop' setting.",
        "X is a retrigger input. A trigger pulse in excess of 1V will reset the playback position. The initial playback position is set by the Y input. The voltage range 0-8V corresponds to the length of the file so e.g. 0V input (or no input) sets the initial position to the start of the file, 4V input sets the initial position to halfway through the file, etc.",
        "When switching between files, the playback position is maintained, modulo the length of the new file. For example, if you're 5 seconds into a 10 second file:",
        "• if you switch to a 20 second file, the position will be 5 seconds into the new file.",
        "• if you switch to a 2 second file, the position will be 1 second into the new file.",
        "(Though see the 'useStartOnSampleChange' playlist option above to override this behaviour.) A & B are the left & right audio outputs respectively.",
        "Parameter 0 chooses the sample folder. These are sorted alphabetically, or in the order specified in the playlist, if one is provided.",
        "Parameter 1 sets the trigger mode and envelope time. If the parameter is 0, the trigger input is simply that – only a positive-going edge is used, to retrigger the sample. If the parameter is 1 or more, then the trigger input is treated like a gate: a positive-going edge retriggers the sample, but also when the trigger CV goes low, the sample playback stops. The value of the parameter specifies the length of a decay envelope that is applied to the sample, so it can stop suddenly or gradually fade out.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X input – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback."
    ],
    "65": [
        "This algorithm plays audio files, the speed of which is set by incoming clock pulses.",
        "The current audio file is selected with the Z knob/CV, if parameter 2 is -1, or by the parameter itself, if it is in the range 0-99.",
        "X is a retrigger input. A trigger pulse in excess of 1V will reset the playback position to the start of the sample, if Z is being used to select the sample, or to the position set by Z (the full range of Z, approximately -5V to 5V, corresponds to the length of the sample).",
        "Y is the clock input. The speed of the sample playback is adjusted so that the whole sample fits into the time taken for a number of clocks, where that number is set (per sample) in the playlist.",
        "When switching between files, the playback position is maintained, as for the I-1Audio Playback algorithm.",
        "A & B are the left & right audio outputs respectively.",
        "Parameters 0 & 1 are the standard sample folder and envelope time parameters, described above.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X input – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback."
    ],
    "66": [
        "This algorithm is much the same as 'I-1 Audio Playback', except that it forgoes the sample start position input and instead has a pitch input.",
        "Y is the pitch input, using the 1V/octave standard. 0V corresponds to the sample playing at its natural pitch. Positive voltages speed up playback; negative voltages slow it down.",
        "Parameter 1 shifts the pitch up or down in octave increments.",
        "Note that there is a limit to how fast data can be streamed from the SD card. If you speed playback up by a large factor, you may get dropouts.",
        "Parameters 0 & 2 are the standard sample folder and envelope time parameters, described above.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X input – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback. Additionally, the pitch of the note on message is used instead of the Y input CV, so you can effectively play the disting like a sampler from a MIDI keyboard. MIDI note 48 (C3) corresponds to a 0V input i.e. playing the sample at its natural pitch. MIDI pitch bend is supported; parameter 4 sets the bend depth in semitones.",
        "Parameter 3 'MIDI mode' allows for polyphonic operation, using multiple disting mk4 modules. If the parameter is -1 or 0, the module responds to MIDI like a monophonic synthesizer10. Otherwise, the parameter is a 'voice ID' in a polyphonic setup. By giving different voice IDs to multiple distings, and feeding them the same MIDI, you can create a polyphonic sample player where each disting takes a different note of a held chord.",
        "(Recall that the Select Bus provides a convenient way to send the same MIDI to multiple distings without extra cabling - see above.)",
        "By default the polyphonic operation uses a 'lowest voice' allocation scheme – each new note is allocated to the voice with the lowest ID that is not currently playing a note. It is also possible to select a 'round robin' allocation scheme, which often works better with samples with a decay tail. This is done by sending MIDI CC #21 with a value of the number of polyphonic voices available. Sending this CC also resets the round robin to voice 1 (you may like to do this at the start of a song playback, for example, to ensure consistent results on each play). Sending CC #21 with value 0 reverts to lowest voice allocation."
    ],
    "67": [
        "This algorithm is much the same as the 'I-1 Audio Playback' algorithm, except that it forgoes voltage control of the current sample and instead offers a speed control.",
        "Z is the linear speed control. The central position corresponds to the sample playing at its natural pitch. Positive voltages speed up playback; negative voltages slow it down. Because the scale is linear it is possible to slow it down all the way to being stopped.",
        "The current sample is selected via parameter 1.",
        "Parameters 0 & 2 are the standard sample folder and envelope time parameters, described above.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X input – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback."
    ],
    "68": [
        "Similar to “I-4 Audio Playback with Z Speed” except that the playback speed is allowed to go negative i.e. the sample can play backwards. Playback speed is linear with Z, with a maximum of around 2x speed, and with 0V/center Z corresponding to a speed of zero.",
        "Input Y selects the sample. Parameter 1 is added to input Y, so you can effectively use either or a combination of both to select the sample. Note that in this algorithm a maximum of 50 samples are accessible, not the usual 100.",
        "The algorithm caches a reversed copy of each sample to the MicroSD card. It does this once only for each sample, when it finds a new sample or one that has changed. This may take a few seconds, during which time the message “Processing...” scrolls across the display. Do not remove the MicroSD card or turn off the disting during this time, in case the MicroSD card becomes corrupted.",
        "Parameters 0 & 2 are the standard sample folder and envelope time parameters, described above.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X input – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback."
    ],
    "69": [
        "In this algorithm the sample playback position is directly driven from the Y input. Imagine a piece of audio tape passing over a tape head – in other algorithms, that tape is constantly moving at some speed or other as if driven by a motor, but in this algorithm you're basically dragging the tape back and forwards over the playhead yourself.",
        "Parameter 1 sets a limit on the speed at which the audio can play. With long samples or rapidly changing Y inputs it is easy to demand very high playback speeds, and this parameter enables you to put a cap on that.",
        "Parameter 2 sets a slew limit, effectively putting a low-pass filter on the Y input. This is useful particularly when using a manually-generated CV to remove any “twitchiness”.",
        "Parameter 3 sets an offset on the Y input, essentially adding or subtracting a constant voltage.",
        "The algorithm caches a reversed copy of each sample to the MicroSD card. It does this once only for each sample, when it finds a new sample or one that has changed. This may take a few seconds, during which time the message “Processing...” scrolls across the display. Do not remove the MicroSD card or turn off the disting during this time, in case the MicroSD card becomes corrupted.",
        "Parameter 0 is the standard sample folder parameter, described above."
    ],
    "70": [
        "This algorithm simultaneously plays two audio files, each with its own trigger input. It was developed particularly with drum triggering in mind, but all the usual playback options are supported. For drum applications, the preferred playlist options are:",
        "-loop=0",
        "-gap=0",
        "-fadeIn=0",
        "-fadeOut=0",
        "-retriggerOnSampleChange=0",
        "The Z knob/input selects the samples, in pairs – the sample triggered by the X input is always an even-numbered sample, and the Y input triggers the next sample up.",
        "Parameter 1 selects between two options for how the outputs are used:",
        "– If the parameter is 0, then the sample triggered by X plays out of output A, and the sample triggered by Y plays out of output B. Stereo samples are summed to mono.",
        "– If the parameter is 1, then mono samples are panned centrally, and stereo samples are played in stereo.",
        "Parameters 0 & 2 are the standard sample folder and envelope time parameters, described above.",
        "The triggers are 'velocity sensitive' – the volume of the sample depends on the voltage of the trigger pulse.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X & Y inputs – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback. MIDI note 48 (C3) triggers sample A; note 49 triggers sample B."
    ],
    "71": [
        "Similar to “I-7 Dual Audio Playback” except that the sample playback speed is controlled by the Z knob/CV input.",
        "The two samples are selected by parameters 1 & 2.",
        "Parameter 3 selects the panning option – refer to the description in the algorithm above.",
        "Parameter 4 selects which samples are affected by the speed control, as follows:",
        "0 Both samples' speeds controlled by Z.",
        "1 Sample A speed fixed; B variable.",
        "2 Sample B speed fixed; A variable.",
        "3 Both samples' speeds are fixed.",
        "Parameters 0 & 5 are the standard sample folder and envelope time parameters, described above.",
        "The triggers are 'velocity sensitive' – the volume of the sample depends on the voltage of the trigger pulse.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X & Y inputs – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback. MIDI note 48 (C3) triggers sample A; note 49 triggers sample B."
    ],
    "72": [
        "Algorithm-specific playlist filename: midi-playlist-clocked.txt",
        "This algorithm plays MIDI files, converting the MIDI into CV outputs on A & B (as detailed above).",
        "The current MIDI file is selected with the Z knob/CV, if parameter 0 is -1, or by the parameter itself if it is in the range 0-31, in which case Z is not used.",
        "The X input is a clock, which controls the speed of the MIDI file playback. A clock pulse should exceed 1V. The clocks correspond to quarter notes in the MIDI file.",
        "Y is a retrigger input. A trigger pulse in excess of 1V will reset the file to the beginning.",
        "MIDI Output: the MIDI file being played is transmitted unaltered on the disting's MIDI output."
    ],
    "73": [
        "This algorithm plays audio files, using a 1V/octave pitch input (Y) to both select the sample and control its pitch. This would typically be used for playing a multisampled instrument across a range of pitches, or for mapping individual sounds (e.g. drums) to different notes.",
        "This is a dual version of the Multisample Audio Playback algorithm below. Two voices play at once; they can play continuously, but a more typical use would be to use the envelope time parameter to have notes decay when the gate closes – then, this being a dual algorithm, one note can continue to decay while the next one starts.",
        "The other main difference between this and the monophonic Multisample Audio Playback algorithm is in the behaviour of the pitch CV input. In the monophonic algorithm the pitch CV is used to choose the sample when triggered, but also continues to be 'live' during the playback, allowing bends, vibrato etc. In this dual algorithm, the pitch CV is sampled when the playback is triggered; subsequent CV change has no effect until it moves by more than a semitone, in which case a new note is triggered.",
        "X is a retrigger input. A trigger pulse in excess of 1V will reset the playback position to the start of the sample. The trigger is 'velocity sensitive' – the volume of the sample depends on the voltage of the trigger pulse.",
        "The Z knob/CV provides a tuning control, with a range of approximately ±0.5 octaves. Note that this is applied after the sample has been selected using the Y CV; changing Z will not affect the sample selection.",
        "A & B are the left & right audio outputs respectively.",
        "Parameter 1 shifts the pitch up or down in octave increments. It is equivalent to offsetting the pitch CV input – it also affects the sample selection.",
        "Parameters 0 & 2 are the standard sample folder and envelope time parameters, described above.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X input – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback. Additionally, the pitch of the note on message is used instead of the Y input CV, so you can effectively play the disting like a sampler from a MIDI keyboard. MIDI note 48 (C3) corresponds to a 0V input. MIDI pitch bend is supported; parameter 4 sets the bend depth in semitones.",
        "Parameter 3 'MIDI mode' works in the same way as for algorithm I-3 – see above.",
        "Parameter 5 sets the sample panning as in the Dual Audio Playback algorithm above. This algorithm defaults the setting to 1 so that the two voices are summed, but setting it to zero can give you some nice stereo effects where alternate notes are panned oppositely.",
        "Please see below for information regarding Multisample playlists."
    ],
    "74": [
        "Algorithm-specific playlist filename: midi-playlist-free.txt",
        "This algorithm plays MIDI files, converting the MIDI into CV outputs on A & B (as detailed above).",
        "The current MIDI file is selected via the parameter i.e. by turning the S knob.",
        "The playback speed is set by a combination of the Z knob/CV and the X CV. With both at zero, the MIDI file plays at 120bpm. Z offers a linear speed control - positive voltages speed up playback; negative voltages slow it down. Because the scale is linear it is possible to slow it down all the way to being stopped. X offers an exponential (1V/octave) speed control - the speed doubles for every 1V above zero, and halves for every 1V below zero.",
        "Y is a retrigger input. A trigger pulse in excess of 1V will reset the file to the beginning.",
        "MIDI Output: the MIDI file being played is transmitted unaltered on the disting's MIDI output."
    ],
    "75": [
        "This algorithm is much the same as the base I-1 Audio Playback algorithm, except that it forgoes voltage control of the current sample and instead offers control over the sample end point.",
        "X and Z are the retrigger and end position controls.",
        "• If Z is negative, X is the retrigger input, and Z controls the sample end point. So, if you require manual control over the end point, turn the Z knob counterclockwise to shorten the sample.",
        "• If Z is positive, Z is the retrigger input, and X controls the sample end point. In this case X is scaled in the same way as input Y, so varying Y and feeding X the same CV plus a small offset will give you a short segment of the sample that moves around with the input. The trigger fed into Z should be a positive pulse over about 1V.",
        "When Z is adjusted through the switching point between these two modes, the display will show \"Xt\" or \"Zt\" (for X trigger or Z trigger) for a short while.",
        "The current sample is selected via parameter 1.",
        "Parameters 0 & 2 are the standard sample folder and envelope time parameters, described above.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X input – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback."
    ],
    "76": [
        "This algorithm records the incoming audio to a WAV file on the MicroSD card.",
        "X & Y are the audio inputs. The incoming audio is echoed directly to the A & B outputs.",
        "The Z knob/CV controls recording. When Z exceeds approximately 1V, recording starts. When it falls below 0.5V, recording stops.",
        "Do not remove the MicroSD card or power off the disting while recording is active, as this could corrupt the card.",
        "The recorded WAV files are stereo, 16 bit, 46.875kHz. The files are named sequentially starting with REC00000.WAV (then REC00001.WAV, REC00002.WAV etc.). If there are already recordings on the card, the next available filename will be used; the old files will not be overwritten.",
        "The files are placed in a folder named '!RECORD'11. If this folder does not exist, it will be created.",
        "When recording is complete, a small text file will also be written to the card, with the same filename but with the extension '.TXT'. This will detail any dropouts that occurred while recording the file (or ideally simply 'No dropouts').",
        "The disting's screen shows different information than the usual algorithm name or parameter values in this mode. The left two columns of LEDs display level meters for the two audio inputs. The right section of the screen either shows a rectangle (for recording stopped) or a recording animation (when recording)."
    ],
    "77": [
        "This algorithm plays audio files, using a 1V/octave pitch input (Y) to both select the sample and control its pitch. This would typically be used for playing a multisampled instrument across a range of pitches, or for mapping individual sounds (e.g. drums) to different notes.",
        "X is a retrigger input. A trigger pulse in excess of 1V will reset the playback position to the start of the sample.",
        "The Z knob/CV provides a tuning control, with a range of approximately ±0.5 octaves. Note that this is applied after the sample has been selected using the Y CV; changing Z will not affect the sample selection.",
        "A & B are the left & right audio outputs respectively.",
        "Parameter 1 shifts the pitch up or down in octave increments. It is equivalent to offsetting the pitch CV input – it also affects the sample selection.",
        "Parameters 0 & 2 are the standard sample folder and envelope time parameters, described above.",
        "MIDI Input: MIDI note on & off messages are handled equivalently to a trigger or gate on the X input – that is, a note on retriggers the sample, and if the envelope time is non-zero, a note off will stop the playback. Additionally, the pitch of the note on message is used instead of the Y input CV, so you can effectively play the disting like a sampler from a MIDI keyboard. MIDI note 48 (C3) corresponds to a 0V input. MIDI pitch bend is supported; parameter 4 sets the bend depth in semitones.",
        "Parameter 3 'MIDI mode' works in the same way as for algorithm I-3 – see above."
    ],
    "78": [
        "This algorithm is identical to 'J-5 Audio Recorder' except that the files recorded are in mono, using the left (X) input, and the files are placed in a folder named '!RECORD1'.",
        "This can be useful when intending to use the recorded audio in the disting's own playback modes, since mono samples place less stress on the SD card throughput, and can be re-pitched higher."
    ],
    "79": [
        "The raison d'être of this algorithm is creating smooth textural loops out of any source material13. It is particularly useful for material captured by the disting's own Audio Recorder modes, which won't have carefully edited loop points. It can also take a clock and adjust the loop time to fit.",
        "In this algorithm, the playlist settings 'loop', 'fadeIn', 'fadeOut', and 'gap' are ignored. X is a gate or clock input, depending on the parameter 3, 'Gate mode':",
        "0 X is a gate CV, starting and stopping sample playback.",
        "1 The sample plays continuously.",
        "2 The sample plays continuously. X is a clock CV. The loop length is adjusted to be related to the time between clocks by a power of two e.g. 2, 4, 8 but also 1⁄2, 1⁄4, etc. if the clocks are slower than the longest possible loop.",
        "Note that with nothing plugged in to X, switching between modes 0 & 1 gives you a means to start and stop playback manually.",
        "Input Y is a pitch CV input following the 1V/octave standard. Note that pitching up a crossfaded sample places great demands on the SD card throughput, and there is a limit to how high you can raise the pitch. In our tests, stereo files can only be raised by about a fourth. Mono files can be played at considerably higher pitches.",
        "The Z knob/CV selects the sample. The transition from one sample to the next is a smooth crossfade. Note that if the sample has the 'retriggerOnSampleChange' option set to 0, changing Z will not change the sample – it will only change when playback is stopped and restarted (by the X CV or manually via parameter 3).",
        "A & B are the left & right audio outputs respectively.",
        "Parameter 0 is the standard sample folder parameter, described above.",
        "Parameter 1 shifts the pitch up & down by octaves. (Note the comments above on how high the pitch may be raised.)",
        "Parameter 2 sets the crossfade time, in percent of the sample time."
    ],
    "80": [
        "This algorithm is a wavetable VCO. See for example here for a brief overview of wavetable synthesis.",
        "X is the pitch input for the VCO, with a 1V/octave response. The 0V point for the pitch input is C3 (approximately 130.81Hz).",
        "The Z knob/CV provides a tuning control, with a range of approximately ±0.5 octaves.",
        "The Y input controls the lookup point in the wavetable, with a range of ±5V covering the whole table. Parameter 2 offsets the Y CV, effectively providing a means of manual wave selection.",
        "Output A is the main output of the wavetable VCO.",
        "Output B generates a signal according to parameters 3 and 4. If parameter 4 is -1 (the default), the output is as follows:",
        "-3 A ±8V square wave one octave below output A",
        "-2 Wavetable VCO one octave below output A",
        "-1 Wavetable VCO one octave above output A",
        "0-99 Wavetable VCO detuned relative to output A; output A is also detuned in the opposite direction.",
        "If parameter 4 is 0-99, output B is a copy of output A with a fixed phase offset from 0-99% as defined by the parameter. (So for example if you want quadrature outputs, set the phase to 25.)",
        "MIDI Input: MIDI note messages received on the MIDI channel set in the Settings are converted to a CV which is added to that on input X. The 0V note is 48 (C3)."
    ],
    "81": [
        "This algorithm offers a wavetable oscillator intended for LFO use, though with an audio rate clock it can also be used at audio frequencies. Consider it a combination of the Wavetable VCO and the Clockable LFO.",
        "See 'Loading wavetables' above for a description of how to load wavetables onto the SD card.",
        "Input X is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the cycle time.",
        "The Y input controls the lookup point in the wavetable, with a range of ±5V covering the whole table. Parameter 1 offsets the Y CV, effectively providing a means of manual wave selection.",
        "The Z knob/CV sets a scale factor which is applied to the cycle time. The scale is an integer (whole number) which either multiplies or divides the frequency, and ranges in value from 1-16.",
        "When Z changes, the scale is shown on the display. If the value shown is negative, it is a divisor rather than a multiplier. Note that there is no value of \"-1\" since dividing by 1 and multiplying by 1 are the same.",
        "Outputs A & B are the result of the wavetable lookup. Each output has its own attenuverter on parameters 2 & 3 respectively."
    ],
    "82": [
        "Applied to audio, this algorithm is a wavetable-based waveshaper effect. More generally, considering the input as a CV lookup, this algorithm provides a wavetable-based transfer function.",
        "See 'Loading wavetables' above for a description of how to load wavetables onto the SD card.",
        "X is the input audio or CV. The range ±5V spans the full waveform.",
        "Z applies a gain to X, with a range from 1x to approximately 16x.",
        "The Y input controls the lookup point in the wavetable, with a range of ±5V covering the whole table. Parameter 1 offsets the Y CV, effectively providing a means of manual wave selection.",
        "Output A is the main output of the wavetable lookup. Output B is the same but using an inverted Y i.e. when A is using the first wave in the table, B will be using the last and vice versa."
    ],
    "83": [
        "This algorithm is essentially a version of the Clockable Wavetable LFO, but with a trigger input instead of being free-running. As such it can be thought of as a kind of envelope generator, where the envelope shape is defined by an audio file in the wavetable.",
        "See 'Loading wavetables' above for a description of how to load wavetables onto the SD card.",
        "Input X is the clock input. Any clock pulse in excess of 1V can be used. The time between rising trigger edges is used to set the envelope time.",
        "The Y input controls the lookup point in the wavetable, with a range of ±5V covering the whole table. Parameter 1 offsets the Y CV, effectively providing a means of manual wave selection.",
        "The Z input is the trigger for the envelope to start.",
        "Outputs A & B are the result of the wavetable lookup. Each output has its own attenuverter on parameters 2 & 3 respectively.",
        "Parameter 4 applies a multiplier to the envelope time, according to the table in the Clockable Delay/Echo section, above."
    ],
    "84": [
        "Output A is a quantized version of the sum of inputs X & Y, according to the scale chosen with parameter 0.",
        "The scales are defined by files on the MicroSD card – see “Scala Support”, above. The keyboard mapping file is used to define the subset of notes that the quantizer may use. For example, in the provided example files, the file 'root+fifth.kbm' can be used with a 12 note scale to make the quantizer only output the root or fifth in each octave.",
        "Output B is a trigger signal which fires whenever output A changes - a 5V pulse approximately 10ms long.",
        "Parameters 1 & 2 are attenuators for inputs X & Y respectively. At -1 the input is completely attenuated; at 31 the input is unattenuated.",
        "If parameter 2 is set to -2, input Y becomes a trigger. In this mode, input X is only sampled and converted to a new quantized value when input Y rises over approximately 1V. (In non-triggered mode, X is constantly sampled and a new note is output as soon as X moves to the next scale degree.)",
        "Parameter 3 is a transpose control. The transposition occurs after the quantization, and is in terms of the mapped notes of the scale. For example, if you're using a seven tone scale, with all tones mapped, then a transposition of 7 raises or lowers the pitch by an octave.",
        "Parameter 4 sets an offset between the timing of the X & Y inputs (in sample frames). When using Y as a trigger, it is often a good idea to delay it slightly relative to the pitch, to ensure that the pitch has changed and settled before the trigger samples a new note.",
        "The Z knob/CV controls the slew rate of output A. At the minimum value of Z, changes in A are instantaneous. As Z increases, changes in A take place more slowly.",
        "MIDI Output: each new note (i.e. when the Output B trigger fires) is output as a MIDI note message on the MIDI channel selected in the settings. The note value is that of the position in the keyboard mapping of the current output."
    ],
    "88": [
        "A stereo reverberation effect.",
        "X and Y are the stereo audio inputs. An equal mix of these is used to feed the reverberator. A and B are the stereo audio outputs. These are a mix of the inputs and the reverb output.",
        "Z is a wet/dry control. At zero, the output is 100% dry i.e. the input signals with no reverb added. For positive Z, reverb is added while holding the dry level constant. For negative Z, the dry and reverb signals are progressively crossfaded, until eventually the output is 100% wet i.e. just the reverberation signal.",
        "Pressing the Z knob 'freezes' the reverb – the reverb does not decay, and the input signal is not added into the reverb. Press Z again to unfreeze it.",
        "Parameters 0 & 1 together control the reverb time.",
        "Parameter 2 changes the reverb 'character' - it chooses between a number of options for the reverb algorithm's internal parameters leading to different sounding reverbs (some quite natural, others deliberately unnatural).",
        "Parameter 3 applies a low pass filter to the reverb input. It does not affect the dry portion of the signal.",
        "Parameter 4 is a gain control for the reverb output, in dB. It does not affect the dry signal.",
        "Parameter 5 allows Z to become a CV input for the freeze feature. When the parameter is from -32 to 32, this value is used to control the wet/dry balance, and the Z input becomes a freeze trigger. The reverb freezes when Z goes above approximately 1V and unfreezes when Z falls below approximately 0.5V."
    ],
    "89": [
        "A mono-to-stereo reverberation effect.",
        "X is the audio input.",
        "A and B are the stereo audio outputs. These are a mix of the input and the reverb output.",
        "Z is a wet/dry control. At zero, the output is 100% dry i.e. the input signal with no reverb added. For positive Z, reverb is added while holding the dry level constant. For negative Z, the dry and reverb signals are progressively crossfaded, until eventually the output is 100% wet i.e. just the reverberation signal.",
        "Pressing the Z knob 'freezes' the reverb – the reverb does not decay, and the input signal is not added into the reverb. Press Z again to unfreeze it.",
        "Parameters 0 & 1 together control the reverb time. Input Y also affects the feedback.",
        "Parameter 2 changes the reverb 'character' - it chooses between a number of options for the reverb algorithm's internal parameters leading to different sounding reverbs (some quite natural, others deliberately unnatural).",
        "Parameter 3 applies a low pass filter to the reverb input. It does not affect the dry portion of the signal.",
        "Parameter 4 is a gain control for the reverb output, in dB. It does not affect the dry signal.",
        "Parameter 5 allows Z to become a CV input for the freeze feature. When the parameter is from -32 to 32, this value is used to control the wet/dry balance, and the Z input becomes a freeze trigger. The reverb freezes when Z goes above approximately 1V and unfreezes when Z falls below approximately 0.5V."
    ],
    "90": [
        "A dual mono reverberation effect.",
        "X and Y are the audio inputs.",
        "A and B are the audio outputs. Each is a mix of its input and corresponding reverb output.",
        "Z is a wet/dry control. At zero, the outputs are 100% dry i.e. the input signal with no reverb added. For positive Z, reverb is added while holding the dry level constant. For negative Z, the dry and reverb signals are progressively crossfaded, until eventually the outputs are 100% wet i.e. just the reverberation signals.",
        "Pressing the Z knob 'freezes' the reverbs – the reverbs do not decay, and the input signals are not added into the reverbs. Press Z again to unfreeze them.",
        "Parameters 0 & 1 together control the reverb time.",
        "Parameter 2 changes the reverb 'character' - it chooses between a number of options for the reverb algorithm's internal parameters leading to different sounding reverbs (some quite natural, others deliberately unnatural).",
        "Parameter 3 applies a low pass filter to the reverb inputs. It does not affect the dry portion of the signals.",
        "Parameter 4 is a gain control for the reverb output, in dB. It does not affect the dry signal.",
        "Parameter 5 allows Z to become a CV input for the freeze feature. When the parameter is from -32 to 32, this value is used to control the wet/dry balance, and the Z input becomes a freeze trigger. The reverbs freeze when Z goes above approximately 1V and unfreeze when Z falls below approximately 0.5V."
    ],
    "91": [
        "A dual vowel filter effect. A set of three bandpass filters (BPFs) is used to mimic the response of the human vocal tract, resulting in vowel-like sounds when provided suitable source material.",
        "The algorithm can be used as a dual-mono effect, or as stereo (in which case you'd want to select the same vowels for each channel).",
        "Parameters 0 & 1 select the vowel sound for X/A and Y/B respectively. The available sounds are as follows:",
        "-1",
        "Chosen from the range below by the Z knob/CV.",
        "0 /ow/ bought",
        "1 /oo/ boot",
        "2 /a/ hot",
        "3 /uh/ but",
        "4 /er/ bird",
        "5 /ae/ bat",
        "6 /e/ bet",
        "7 /i/ bit",
        "8 /iy/ beet",
        "For a good vowel effect, the input audio should be rich in harmonics. A simple sawtooth works reasonably well. However, you can of course put any audio you want through the filters.",
        "Parameters 2 & 3 allow fine tuning of the gains of the second and third BPFs, which can be used to tweak the vowel sounds if they're not quite right for your usage."
    ],
    "92": [
        "A stereo chorus/flange effect.",
        "X is the audio input.",
        "A and B are the stereo audio outputs. These are a mix of the input and the chorus output.",
        "Z is a wet/dry control. At zero, the outputs are 100% dry i.e. the input signal with no chorus added. For positive Z, chorus is added while holding the dry level constant. For negative Z, the dry and chorus signals are progressively crossfaded, until eventually the outputs are 100% wet i.e. just the chorus signals.",
        "The chorus effect is generated via a number of LFOs. The LFO depth is set with parameter 0. The LFO speeds are set with a combination of parameter 1 and input Y, which is a 1V/octave input centred on 4Hz for 0V.",
        "Parameter 2 controls a feedback loop around the effect. Parameter 7 engages a saturation stage in the feedback loop, which can prevent clipping, while adding some colouration to the sound.",
        "Parameter 3 applies a low pass filter to the chorus input. It does not affect the dry portion of the signals.",
        "Parameters 4 & 5 together set the delay time, with a range of approximately 200ms. Very small values give flanging; medium values (25-50ms) are more typical for chorus. Larger values give recognisable echoes.",
        "Parameter 6 sets the number of stages i.e. the number of simultaneous delayed/modulated signals that combine to produce the effect. Higher values will give a smoother, lusher chorus; small values are more appropriate to give a sharper, more defined modulation, especially for flanging."
    ],
    "93": [
        "A mono chorus/flange effect. X is the audio input.",
        "A and B are audio outputs. Output A is a mix of the input and the chorus output; output B is just the chorus output.",
        "Z is a wet/dry control. At zero, the output A is 100% dry i.e. the input signal with no chorus added. For positive Z, chorus is added while holding the dry level constant. For negative Z, the dry and chorus signals are progressively crossfaded, until eventually the output is 100% wet i.e. just the chorus signal.",
        "The chorus effect is generated via a number of LFOs. The LFO depth is set with parameter 0. The LFO speeds are set with a combination of parameter 1 and input Y, which is a 1V/octave input centred on 4Hz for 0V.",
        "Parameter 2 controls a feedback loop around the effect. Parameter 7 engages a saturation stage in the feedback loop, which can prevent clipping, while adding some colouration to the sound.",
        "Parameter 3 applies a low pass filter to the chorus input. It does not affect the dry portion of the signal.",
        "Parameters 4 & 5 together set the delay time, with a range of approximately 200ms. Very small values give flanging; medium values (25-50ms) are more typical for chorus. Larger values give recognisable echoes.",
        "Parameter 6 sets the number of stages i.e. the number of simultaneous delayed/modulated signals that combine to produce the effect. Higher values will give a smoother, lusher chorus; small values are more appropriate to give a sharper, more defined modulation, especially for flanging."
    ],
    "94": [
        "A simple 2 channel mono-to-stereo mixer.",
        "Parameters 0 & 1 set the gain for inputs X & Y respectively (in dB). At -40 the signal is completely",
        "attenuated (i.e. it's actually –∞dB).",
        "Z sets the pan for input X. The pan for input Y is set by parameter 2."
    ],
    "95": [
        "A stereo (noise) gate. The outputs are muted unless the input signal exceeds a threshold level.",
        "The Z knob/CV sets the threshold, with a range of approximately 0-8V.",
        "The outputs are muted by an envelope, triggered by the input signal rising above the threshold level. Parameters 0-2 set the attack, hold and release times of the envelope. The hold time is the minimum amount of time the envelope is considered to be triggered. The approximate time ranges for each parameter are: attack 10ms-1.8s, hold 0-600ms, release 45ms-8s.",
        "Parameter 3 sets a lookahead time, effectively delaying the audio slightly relative to the trigger detection. This can be used to ensure that sharp transients are not lost during the attack time of the envelope. The maximum lookahead is about 10ms."
    ],
    "96": [
        "This algorithm combines LFOs and a ramp generator, a combination often used for vibrato which starts gradually from the beginning of each note. The LFO is in fact not 'delayed' as such, but the naming is a nod to the equivalent feature on such classic synths as the Juno-6.",
        "Input X triggers the ramp, which starts from zero and ramps linearly up to a maximum over a time set from Y, which is an exponential, 1V/octave, input. The LFO may be multiplied by the ramp, so it also starts from zero and ramps up to full amplitude.",
        "The trigger also resets the LFO phase to zero. This could be used even without the ramp to give you a resettable LFO.",
        "The Z knob/input controls the LFO speed, which is also an exponential control.",
        "Parameters 0 and 1 select the output waveforms on outputs A & B respectively. The choices are:",
        "0 the ramp itself",
        "1 triangle affected by ramp",
        "2 sine affected by ramp",
        "3 square affected by ramp",
        "4 triangle",
        "5 sine",
        "6 square",
        "Parameters 2 & 3 set the range of the LFO and ramp times, both in quarter octaves (i.e. raising the value by 4 doubles the speed).",
        "Parameters 4 & 5 are attenuverters for outputs A & B, which apply whatever the selected output waveforms. Negative values mean you can have a descending ramp, or LFOs with inverted phase. The unattenuated levels are 0-8V for the ramp and ±8V for the LFOs."
    ],
    "97": [
        "This algorithm generates LFOs, the amplitude and DC offset of which is controlled by the input CVs, according to parameter 3 ('Mode').",
        "If parameter 3 is zero, the X & Y inputs set the minimum and maximum values that the LFO will reach. For example, if X is 3V and Y is 5V, the LFOs will sweep between 3-5V, or to look at it another way, the LFOs will be centred at 4V, with a peak-to-peak amplitude of 2V.",
        "If parameter 3 is one, the X input sets the centre of the LFO, while the Y input sets its amplitude. For example, if X is 3V and Y is 1V, the LFOs' range will be 2V-4V. Note that in this mode if Y is zero, then A & B follow X. If X is a pitch CV, then you effectively have a vibrato control on Y.",
        "The Z knob/input controls the LFO speed, which is an exponential control.",
        "Parameters 0 and 1 select the output waveforms on outputs A & B respectively. The choices are:",
        "0 triangle",
        "1 sine",
        "2 square",
        "3 rising ramp",
        "4 falling ramp",
        "Parameter 2 sets the range of the LFO speed, in quarter octaves (i.e. raising the value by 4 doubles the speed).",
        "Parameters 4 & 5 are offsets applied to inputs X & Y respectively. They are scaled in twelfths of a Volt, so if interpreted as pitch CVs, in semitones."
    ],
    "98": [
        "This algorithm performs logical operations on the X & Y inputs. The inputs first pass through adjustable comparators, so you can feed X & Y either with straight gate/trigger signals, or with more general CVs.",
        "X & Y are the inputs. A & B are the outputs, which are 0/5V logical (on/off) signals.",
        "The Z knob/CV sets the logical operation performed for output A. The options are AND, OR, XOR, NAND, NOR, and XNOR; the name of the operation selected is shown in the display as Z changes.",
        "Parameter 0 sets the logical operation performed for output B:",
        "-2",
        "Output B follows output A",
        "-1",
        "Output B is inverse of output A",
        "0 AND",
        "1 OR",
        "2 XOR",
        "3 NAND",
        "4 NOR",
        "5 XNOR",
        "Parameters 1-4 set the input comparator thresholds and hysteresis (for an explanation of hysteresis see here). All are scaled such that 100 corresponds to 5V. The input is taken as logical '1' if the input voltage exceeds the threshold voltage."
    ],
    "99": [
        "This algorithm processes the inputs with half-wave rectification16, in one of two different ways. Equally useful for audio and CV manipulation, this allows you to split a bipolar signal into its positive and negative sections, and to combine two different waveforms, using the positive part of one and the negative part of the other.",
        "For ease of explanation, assume first that the Z knob/CV is at zero.",
        "If the mode (parameter 0) is 0: output A is the positive part of X, plus the negative part of Y. Output B is the negative part of X, plus the positive part of Y.",
        "If the mode is 1 or 2: the inputs are summed (mode 1) or subtracted (mode 2). Then output A is the positive part of X±Y, and output B is the negative part of X±Y.",
        "If the mode is 3: output A is the positive part of input X; output B is the positive part of input Y.",
        "Z is a threshold control, allowing the various comparisons above to be against a non-zero value. So for 'positive part' above read 'part where the value is more than Z' etc."
    ],
    "100": [
        "A stereo filter, switchable between low-, band-, and high-pass (via parameter 0). Parameter 1 sets the filter resonance."
    ],
    "101": [
        "This is a stereo delay/echo effect which simulates a variable speed tape loop echo device. The delay time at '1x speed', with the tape length parameter at maximum, is just over 250ms.",
        "X & Y are the audio inputs.",
        "Parameters 0 & 1 together set the 'tape length', effectively setting the delay time. Parameter 0 is scaled in 10ms increments, while parameter 1 is in 1ms increments (both assuming 1x 'tape speed').",
        "Z controls the speed of the 'tape', which also affects the delay time. The speed range is from half speed to double speed.",
        "Parameter 2 controls the feedback. A value of 32 gives 100% feedback. Outputs A & B carry signals according to parameter 3:",
        "0 A & B are mix.",
        "1 A & B are delay only.",
        "'Mix' is a mix of the dry (undelayed) signal and the delay effect. The amount of delay in the mix rises in direct proportion to the amount of feedback.",
        "'Delay only' is the delayed signal only. Use this and the input signals, plus an external mixer, if you need more flexibility in the dry/wet balance than is offered by the mixed mode."
    ],
    "102": [
        "This is a pitch shifting audio effect, which can also be used as a delay. The pitch shifting is done using a granular technique, that is, the output is composed of many short segments or 'grains' taken from the input.",
        "Input X is the audio input.",
        "Input Y is the pitch CV input, following the 1V/octave standard. Positive input voltages shift the pitch up; negative voltages shift the pitch down.",
        "Output A is a mix of the original audio and the pitch shifted version (according to Z); output B is the pitch shifted version only.",
        "Z is a wet/dry control. At zero, output A is 100% dry i.e. the input signal only. For positive Z, the pitch shifted version is added while holding the dry level constant. For negative Z, the dry and pitch shifted signals are progressively crossfaded, until eventually the output is 100% wet i.e. just the pitch shifted version.",
        "Parameter 0 sets the grain length. Parameter 1 sets the shape of the grain 'window', or if you prefer, its envelope. Best results will depend on the source material – experiment.",
        "The effect uses an internal buffer to store the source material so it can be replayed as grains – therefore there is some delay (or latency) inherent in the algorithm. The delay can be controlled by parameter 2. If you are only ever pitching down, this can be set very low. Pitching up requires a higher latency. If you are viewing this as a delay effect, then set the delay to whatever you like. The maximum delay time is about 400ms.",
        "Parameter 3 sets the delay feedback.",
        "Parameters 4 & 5 provide a means of manually setting a pitch shift without feeding a signal into input Y. Parameter 4 shifts in semitones, while parameter 5 shifts in cents.",
        "Pressing the Z knob 'freezes' the delay buffer – the input signal is no longer written into the buffer and the effect will continuously output the frozen material. Press Z again to unfreeze it.",
        "Parameter 6 allows you to set the mix and free up the Z CV input to control Freeze. When the parameter is at -65 (the default) Z controls the mix. Other values of the parameter set the mix directly (from 100% wet to dry to an equal mix, just like when controlling it via Z), and the Z input becomes a gate control for the Freeze function, freezing the buffer when the CV goes over approximately 1V."
    ],
    "104": [
        "This algorithm is a voltage controlled or triggered crossover switch. That is, either ",
        "X → A and Y → B",
        "or",
        "X → B and Y → A",
        "Note that by using only one input, the algorithm effectively directs an input to one of two outputs (e.g. X to either A or B); likewise, using only one output, the algorithm chooses between two inputs (e.g. A is either X or Y).",
        "Being fully DC-coupled, the algorithm can be used for switching either audio or CV. Parameter 0 chooses the mode – whether the Z knob/CV is a direct switch or a trigger.",
        "In mode 0, Z is a switch. The switch occurs at 0V. Hysteresis can be applied to the switching voltage with parameter 1.",
        "In mode 1, Z is a trigger. A positive-going input edge toggles the switch.",
        "When using an external CV as a switch or trigger, you may like to turn the Z knob slightly counterclockwise.",
        "A crossfade can be applied when switching to avoid clicks. The length of the fade (in milliseconds) is controlled by parameter 2.",
        "Parameter 3 sets the probability that a switch transition will actually occur when triggered. Add one to the parameter value to get the chance in %. The default value of 99 means a 100% chance of the switch transitioning; a value of -1 means a 0% chance i.e. the switch will never change."
    ],
    "105": [
        "This algorithm provides an emulation of a rotary speaker effect.",
        "X is the audio input; A & B are the stereo audio outputs.",
        "The dry/wet mix is controlled by the sum of the Y input and parameter 0.",
        "The Z knob/CV controls the rotation speed. The 0-5V range corresponds to speeds from 0.8Hz to 6.7Hz. Below about -1V the speed decreases and eventually stops altogether.",
        "Parameter 1 sets the depth of the pitch modulation.",
        "Parameter 2 sets the slew rate for speed changes. This plus a 5V gate signal into Z are your route to the classic slow/fast rotary speed transitions.",
        "Parameter 3 controls the frequency of a (first order) crossover filter. The part of the signal above the filter frequency is fed into the rotary pitch modulation effect. The bass signal (below the crossover frequency) is not pitch modulated, but is amplitude modulated at a slightly slower rate than the treble modulation. The depth of the bass modulation is set by parameter 4.",
        "If parameter 3 is zero, the crossover is disabled and the separate bass modulation is not applied.",
        "If the crossover is used, but parameter 4 is zero, this essentially removes the effect entirely from the bass portion of the input, keeping it centre stereo and at unmodulated pitch."
    ],
    "108": [
        "This algorithm is an implementation of pulsar synthesis, inspired by the description in Curtis Roads's book Microsound (MIT Press) pp137-157.",
        "In pulsar synthesis, a small grain of sound (known as a pulsaret, typically a pulse or single cycle waveform) is repeated periodically, followed by a small section of silence. The length of the sound within the repeating period (equivalently, the speed at which it is played) offers a means of control the timbre without affecting the perceived pitch of the sound. By the same token, changing the fundamental pitch without changing the speed at which the grain of sound is played offers pitch change without simply shifting the entire spectrum up and down, an effect reminiscent of 'vocal' or 'formant' synthesis.",
        "This algorithm uses wavetables from the SD card as the source of the pulsarets. See 'Loading wavetables' above for a description of how to load wavetables onto the SD card.",
        "Input X sets the fundamental frequency – the rate at which the pulsaret train is generated.",
        "Input Y sets the 'formant' frequency – the rate at which the pulsaret is played. By default this is independent of the fundamental frequency. If parameter 3 is set to 1, the X input is added to the Y input, so changing the fundamental frequency also changes the formant frequency.",
        "Parameters 0 & 1 choose the wavetable and the wave within the table, respectively. Parameter 2 chooses the window or envelope to apply to the pulsaret. The options are:",
        "0 Rectangular",
        "1 Linear attack",
        "2 Linear decay",
        "3 Gaussian",
        "The Z knob/CV depends on parameter 4. When parameter 4 is zero (the default), Z is a tuning control, with a range of approximately ±0.5 octaves. Otherwise, masking is applied – that is, pulsarets are omitted from the train. In this case, outputs A & B use inverse masks – output B will output a pulsaret when output A is suppressed, and vice versa. If parameter 4 is 1, stochastic masking is applied i.e. pulsarets are randomly masked. The likelihood of a pulsaret being masked is set by Z. If parameter 4 is 2 or more, burst masking is applied – the parameter sets a number of pulsarets, and Z controls how many pulsarets within that number will be masked.",
        "Parameter 5 offsets the X input in octave steps.",
        "MIDI Input: MIDI note messages received on the MIDI channel set in the Settings are converted to a CV which is added to that on input X. The 0V note is 48 (C3)."
    ]
}
